{
    "symbol": "BNB",
    "coin_name": "Binance Coin",
    "shortname": "binance-coin",
    "slug": "binance-coin",
    "display_symbol": "BNB",
    "display": "true",
    "release_date": "2017-07-05",
    "ico_price": 0.15,
    "today_open": 0,
    "market_cap_rank": 4,
    "volume_rank": 8,
    "description": "<p>BNB (stands for &ldquo;Build and Build&rdquo;) is a cryptocurrency that entered circulation via an <a href=\"/ico-calendar/\" target=\"_blank\">initial coin offering</a> (ICO) by the <a href=\"/exchange/binance/\" target=\"_blank\">Binance</a> cryptocurrency exchange in 2017. Binance raised around $15 million through its ICO by selling 100 million BNB tokens (half of the total supply). BNB is the native governance and gas fee payment digital currency of Binance&rsquo;s blockchain network.</p>\n\n<p>Originally, BNB existed on the <a href=\"https://coincodex.com/crypto/ethereum/\" target=\"_blank\">Ethereum</a> blockchain as an <a href=\"/article/56/what-are-erc-20-tokens/\" target=\"_blank\">ERC20</a> standard token. However, the tokens were migrated to their own blockchain called <a href=\"/article/3761/what-is-binance-chain/\" target=\"_blank\">Binance Chain</a> (later renamed to BNB Chain) in 2019. BNB functions as a native asset of the BNB Chain and is used to pay for certain on-chain operations such as paying fees on <a href=\"/exchange/binance-dex/\" target=\"_blank\">Binance DEX</a> or creating new assets. For more information about BNB, <a href=\"/article/7522/what-is-binance-coin/\" target=\"_blank\">click here</a>.</p>\n\n<p><strong>Here&rsquo;s a quick overview of key facts about BNB and its core blockchain features:</strong></p>\n\n<ul>\n\t<li>Issued through an initial coin offering (ICO) campaign in 2017 by the Binance cryptocurrency exchange</li>\n\t<li>Holding the token provides trading fee discounts and other trading perks on the Binance exchange</li>\n\t<li>Native asset of Binance&rsquo;s BNB Chain, used for gas fee payments and community governance</li>\n\t<li>The Binance blockchain network features smart contract functionality, is open source, and shares many other blockchain similarities with Ethereum</li>\n\t<li>Binance intends to destroy half of the initial 200 million BNB token supply using scheduled quarterly burns and real-time token burning mechanics</li>\n\t<li>The Binance exchange was launched in July of 2017 - with the exchange&rsquo;s rapid rise to the top of the industry, the BNB cryptocurrency has also quickly advanced up the market cap rankings</li>\n</ul>\n\n<h3>What is BNB and how does it work?</h3>\n\n<p>BNB is a native asset of the blockchain network created in 2019 by the Binance cryptocurrency exchange. BNB is used for certain BNB Chain operations such as paying fees on Binance DEX or creating new assets.&nbsp;</p>\n\n<p>The token launched on Ethereum as an ERC20 token, but was later swapped at a 1:1 ratio for an equivalent amount of BEP2 BNB tokens on Binance&rsquo;s own blockchain. A year after the launch of the Binance Chain, the exchange launched Binance Smart Chain (later rebranded as BNB Smart Chain) to compete with smart contract platforms like Ethereum and Cardano.</p>\n\n<p>Holding BNB on the Binance exchange gives traders certain benefits &ndash; trading fees are 25% lower if paid in the form of BNB, and holding the coin is also necessary to enter token sales on <a href=\"/ieo-list/binance/\" target=\"_blank\">Binance Launchpad</a>.&nbsp;</p>\n\n<p>Binance is constantly expanding the utility of BNB by securing partnerships with various service providers who accept BNB as payment. BNB can of course be traded on Binance, but its popularity has resulted in other exchanges also listing the coin.&nbsp;</p>\n\n<h3>Creation of BNB</h3>\n\n<p>BNB was launched in 2017 via an ICO on the Ethereum platform. The token was initially named Binance Coin but was later <a href=\"/article/13682/binance-says-bnb-will-expand-beyond-the-exchange-tokens-name-changed-to-build-and-build/\" target=\"_blank\">renamed to BNB</a> as a part of the broader rebranding effort by Binance, which put emphasis on the BNB token&rsquo;s use cases beyond the confines of the exchange ecosystem.</p>\n\n<p>Due to its Ethereum origins, the BNB token was initially an ERC20 digital asset. However, with the launch of BNB Chain in 2019, Binance decided to give owners the ability to swap their tokens to the BEP2 variety at a 1:1 ratio.&nbsp;</p>\n\n<p>The launch of the BNB Smart Chain in 2020 saw BNB become the native governance and gas fee payment currency of Binance&rsquo;s smart contract network, under a new token standard called BEP20. Due to its multi-chain presence, BNB now exists in ERC20, BEP2, and BEP20 varieties.</p>\n\n<p>BNB launched with a total supply of 200 million coins, out of which 80 million was reserved for the founding team, 20 million for angel investors, and the remaining 50% for the public sale. The $15 million haul collected by Binance in the ICO was used for exchange upgrades, marketing and education initiatives, as well as for emergency fund purposes.</p>\n\n<p>In the years following the launch of BNB, Binance emerged as the largest cryptocurrency trading platform in the space, serving millions of customers in dozens of countries around the world. It can be argued that BNB was instrumental in helping Binance achieve its current leading market position, thanks to a plethora of trading benefits and perks available for BNB holders.</p>\n\n<h3>BNB Chain (formerly Binance Chain)</h3>\n\n<p>BNB Chain consists of two parallel blockchains - BNB Beacon Chain (formerly called Binance Chain) and BNB Smart Chain (formerly called Binance Smart Chain). Here&rsquo;s a quick breakdown of each chain&rsquo;s characteristics:</p>\n\n<ul>\n\t<li><strong>BNB Beacon Chain</strong> - BNB Beacon Chain lets users send and receive BNB and other digital assets based on the BEP2 token standard. BNB is used for the payment of transaction fees on the BNB Beacon Chain. The blockchain addresses start with &ldquo;bnb&hellip;&rdquo;.</li>\n\t<li><strong>BNB Smart Chain</strong> - Like BNB Beacon Chain, the BNB Smart Chain is used to send and receive tokens, albeit of the BEP20 variety. Again, BNB is used for gas gee payments. However, BNB Smart Chain provides more than just basic token transfer functionality. The network is compatible with Ethereum smart contracts thanks to its Ethereum Virtual Machine (EVM) compatibility. BNB Smart Chain&rsquo;s addresses start the same as Ethereum ones, with &ldquo;0x&hellip;&rdquo;. To learn more about BNB Smart Chain, <a href=\"/article/10884/what-is-binance-smart-chain-the-pros-and-cons-of-the-binance-smart-chain-blockchain-platform/\" target=\"_blank\">click here</a>.</li>\n</ul>\n\n<h3>Binance&rsquo;s BNB Price History</h3>\n\n<p>During the public sale campaign in 2017, 100 million BNB coins were made available at a price of approximately $0.15 per token (1 ETH for <a href=\"/convert/binance-coin/usd/2700/\" target=\"_blank\">2,700 BNB</a>). The price of BNB increased drastically in the years following the ICO and quickly entered the list of ten largest digital currencies by market cap. Due to its widespread popularity, cryptocurrency investors can <a href=\"/article/1718/how-to-buy-binance-coin-bnb-on-binance/\" target=\"_blank\">buy BNB on Binance</a> as well as on a number of competing digital trading platforms.</p>\n\n<p>Here is what the <a href=\"/crypto/binance-coin/historical-data/\" target=\"_blank\">historical BNB price data</a> tell us about key milestones in the token&rsquo;s price history:</p>\n\n<ul>\n\t<li>$0.15 - Initial investors were able to purchase BNB for roughly $0.15 worth of ETH during 2017&rsquo;s ICO campaign</li>\n\t<li>$1 - Binance Coin price surpassed the $1 mark almost immediately after the BNB crypto tokens started trading in August 2017</li>\n\t<li>$10 - The first time that the BNB coin price climbed over $10 was in December 2017</li>\n\t<li>$100 - BNB price chart showed the token hitting $100 for the first time ever in February 2021, less than four years after its initial launch</li>\n\t<li>$500 - BNB hit the $500 price milestone in April 2021, during a bullish run that saw many digital currencies reach their ATH valuations</li>\n</ul>\n\n<p>On CoinCodex, you can stay up to date with the latest information regarding BNB&rsquo;s live price and check algorithmically generated <a href=\"/crypto/binance-coin/price-prediction/\" target=\"_blank\">BNB price predictions</a> to gain a sense of where its price is likely headed in the short- to mid-term. You can also check the up-to-date market rate of <a href=\"/convert/binance-coin/usd/\" target=\"_blank\">1 BNB to USD</a> via our handy crypto-to-fiat and crypto-to-crypto conversion feature.</p>\n\n<h3>BNB Market Cap</h3>\n\n<p>Given the capped token supply and high BNB token price volatility, the BNB crypto market cap has seen considerable swings over the years. For a better part of its existence, BNB commanded one of the largest market capitalizations in the industry.&nbsp;</p>\n\n<p>Here&rsquo;s what the BNB historical price data tell us about the crypto&rsquo;s most notable market cap milestones:</p>\n\n<ul>\n\t<li>$10 million - BNB first surpassed the $10 million market cap almost immediately after its initial launch in August 2017</li>\n\t<li>$100 million - The market capitalization of BNB increased past $100 million just a month after its launch, in September 2017</li>\n\t<li>$1 billion - In January 2018, BNB reached unicorn status and hit $1 billion market cap valuation</li>\n\t<li>$10 billion - BNB reached a market cap of $10 billion in February 2021</li>\n\t<li>$50 billion - &nbsp;The value of all BNB tokens in circulation reached $50 billion in May 2021</li>\n\t<li>$100 billion - BNB reached a $100 billion market cap in May 2021, during a historic bullish run for BNB and the broader crypto market</li>\n</ul>\n\n<h3>BNB Supply</h3>\n\n<p>BNB had an initial supply of 200 million tokens, with 100 million of the total supply reserved for investors who participated in the ICO. The remaining half was reserved for angel investors and the founding team. The Binance team intends to <a href=\"/article/2159/what-is-a-coin-burn/\" target=\"_blank\">burn</a> all tokens that were not allocated for the public sale via scheduled and real-time BNB burns (read more about the topic in the &ldquo;BNB Token Burns&rdquo; section below).</p>\n\n<p>Despite sharing plenty of similarities with Ethereum, BNB has an artificially limited token supply, unlike ETH. In addition to a capped supply, the number of BNB tokens in circulation is set to decrease over time. These monetary mechanics are putting deflationary pressure on BNB, which could appreciate over time due to a decreasing number of available tokens.&nbsp;</p>\n\n<h4>BNB Token Burns</h4>\n\n<p>Every quarter, Binance burns a portion of its BNB holdings with the eventual goal of cutting the maximum BNB supply from 200 million to 100 million. Since it started as an Ethereum-based ERC-20 token, BNB is not mined, but the entire supply of 200 million was minted at launch.</p>\n\n<p>In addition to quarterly burns&ndash;which are designed to remove a part of the BNB circulating supply calculated <a href=\"/article/13246/binance-introduces-bnb-auto-burn-new-protocol-to-determine-size-of-quarterly-bnb-burns/\" target=\"_blank\">using Auto-Burn</a> formulas based on Binance&#39;s quarterly business results&ndash;BNB&rsquo;s token supply is managed by a real-time burning mechanism as well.&nbsp;</p>\n\n<p>Similar to what the Ethereum platform did for ETH with <a href=\"/article/9921/what-is-eip-1559-and-how-it-will-lower-ethereum-gas-fees-and-make-eth-more-scarce/\" target=\"_blank\">EIP1559</a>, Binance introduced real-time token burns in late 2021. Launched via a network proposal enumerated as <a href=\"/article/13061/bep-95-proposal-goes-live-on-binance-smart-chain-bringing-real-time-bnb-token-burns/\" target=\"_blank\">BEP95</a>, a fixed ratio of the gas fee collected is burned in each block, with the ratio decided by BSC validators.</p>\n\n<p>The scheduled and real-time burns play an important role in trying to make BNB a deflationary asset and helping decrease the token supply to the original goal of 100 million tokens.&nbsp;</p>\n\n<h3>The most important BNB milestones</h3>\n\n<p>Being the native digital token of the largest trading platform in the industry, BNB has experienced a number of notable milestones since its launch in 2017. Here is a list of important dates and events in BNB&rsquo;s eventful past:</p>\n\n<ul>\n\t<li>July 2017 - A week long BNB ICO campaign that ended on July 3rd, 2017 sees Binance raise $15 million in the token sale</li>\n\t<li>February 2019 - The surge in the price of current BNB price sees the token enter the list of the top 10 largest digital currencies by market cap</li>\n\t<li>April 2019 - Binance launches the BNB Chain mainnet and lets users swap their ERC20-based BNB for an equivalent amount of BEP2 BNB tokens</li>\n\t<li>April 2019 - Binance DEX launches on BNB Chain, allowing crypto projects to participate in and issue new tokens on the native blockchain.&nbsp;</li>\n\t<li>September 2020 - Binance launches EVM-compatible BNB Smart Chain that runs in parallel with BNB Beacon Chain</li>\n\t<li>October 2021 - Binance unveils the proposals for the real-time burning of BNB tokens</li>\n\t<li>January 2022 - 1.6 million BNB tokens were destroyed in the first ever quarterly &ldquo;Auto Burn&rdquo;</li>\n\t<li>February 2022 - Binance announces the major rebranding of its core products - Binance Coin becomes BNB (stands for &ldquo;Build and Build&rdquo;), Binance Chain and BSC combine under the BNB Chain umbrella</li>\n</ul>\n",
    "price_high_24_usd": 711.031,
    "price_low_24_usd": 625.9533,
    "start": "2017-06-26 00:00:00",
    "end": "2017-07-03 23:59:00",
    "is_promoted": null,
    "message": "<p class=\"message\">You can invest in  <a href=\"/ieo-list/binance/\">IEOs</a>, <a href=\"https://coincodex.com/cryptocurrencies/sector/defi/\">DeFi tokens</a>, earn interest, stake, and trade with BNB on world's largest crypto exchange - Binance. <a href=\"https://www.binance.com/en/register?ref=37725327\" rel=\"nofollow noopener\" target=\"_blank\">Join Now »</a></p>",
    "website": "https://www.binance.com/",
    "whitepaper": "",
    "total_supply": "200000000",
    "supply": 147575630,
    "platform": "Binance Chain",
    "how_to_buy_url": null,
    "last_price_usd": 704.5145,
    "price_change_1H_percent": -0.4442,
    "price_change_1D_percent": 12.0178,
    "price_change_7D_percent": 16.899,
    "price_change_30D_percent": 18.4835,
    "price_change_90D_percent": 65.2787,
    "price_change_180D_percent": 199.103,
    "price_change_365D_percent": 154.234,
    "price_change_3Y_percent": 78.7693,
    "price_change_5Y_percent": 2136.22,
    "price_change_ALL_percent": 62031.4,
    "price_change_YTD_percent": 117.848,
    "volume_24_usd": 5079764480,
    "trading_since": "2024-06-05 07:53:34",
    "stages_start": "2017-06-26 00:00:00",
    "stages_end": "2017-07-03 23:59:00",
    "include_supply": "true",
    "use_volume": "true",
    "ath_usd": 711.031,
    "ath_date": "2024-06-05 07:07:58",
    "not_trading_since": "2024-06-05 07:53:34",
    "last_update": "2024-06-05 07:52:33",
    "cycle_low_usd": 704.33,
    "cycle_high_usd": 704.527,
    "cycle_low_date": "2024-06-05 07:52:03",
    "cycle_high_date": "2024-06-05 07:52:24",
    "image_id": "afbd377b-db91-423d-0dd4-e8b5db448100",
    "image_t": "afbd377b-db91-423d-0dd4-e8b5db448100",
    "total_total_supply": "147575630",
    "initial_data": {
        "date": "2024-06-05 07:53:34",
        "price_usd": "1.13391",
        "price_btc": "0.000269342",
        "price_eth": "0.00390187"
    },
    "ath_data": {
        "ath_usd": 711.031,
        "ath_usd_date": "2024-06-05 07:07:58",
        "ath_btc": 0.0191964,
        "ath_btc_date": "2022-11-27 02:35:00",
        "ath_eth": 0.289795,
        "ath_eth_date": "2021-04-12 09:35:00"
    },
    "atl_data": {
        "atl_usd": 0.526755,
        "atl_usd_date": "2017-09-15 11:40:05",
        "atl_btc": 0.000153801,
        "atl_btc_date": "2017-12-12 19:50:00",
        "atl_eth": 0.00253315,
        "atl_eth_date": "2017-09-06 12:40:00"
    },
    "social": {
        "Explorer": "https://etherscan.io/token/0xB8c77482e45F1F44dE1745F52C74426C631bDD52",
        "Explorer1": "https://explorer.binance.org/",
        "Explorer2": "https://bscscan.com/",
        "Explorer3": "https://eth.tokenview.io/en/address/0xB8c77482e45F1F44dE1745F52C74426C631bDD52",
        "Facebook": "https://www.facebook.com/469201610080869",
        "GitHub": "https://github.com/binance-exchange",
        "Reddit": "https://www.reddit.com/r/binance",
        "Twitter": "https://twitter.com/binance_2017"
    },
    "socials": [
        {
            "name": "Explorer",
            "value": "https://etherscan.io/token/0xB8c77482e45F1F44dE1745F52C74426C631bDD52",
            "label": "Etherscan",
            "coincodex_socials_id": 13
        },
        {
            "name": "Explorer",
            "value": "https://explorer.binance.org/",
            "label": "Binance",
            "coincodex_socials_id": 13
        },
        {
            "name": "Explorer",
            "value": "https://bscscan.com/",
            "label": "BScan",
            "coincodex_socials_id": 13
        },
        {
            "name": "Explorer",
            "value": "https://eth.tokenview.io/en/address/0xB8c77482e45F1F44dE1745F52C74426C631bDD52",
            "label": "Tokenview",
            "coincodex_socials_id": 13
        },
        {
            "name": "Facebook",
            "value": "https://www.facebook.com/469201610080869",
            "label": "",
            "coincodex_socials_id": 7
        },
        {
            "name": "GitHub",
            "value": "https://github.com/binance-exchange",
            "label": "",
            "coincodex_socials_id": 9
        },
        {
            "name": "Reddit",
            "value": "https://www.reddit.com/r/binance",
            "label": "",
            "coincodex_socials_id": 2
        },
        {
            "name": "Twitter",
            "value": "https://twitter.com/binance_2017",
            "label": "",
            "coincodex_socials_id": 3
        }
    ]
}