{
    "symbol": "BTC",
    "coin_name": "Bitcoin",
    "shortname": "bitcoin",
    "slug": "bitcoin",
    "display_symbol": "BTC",
    "display": "true",
    "release_date": "2009-01-03",
    "ico_price": null,
    "today_open": 0,
    "market_cap_rank": 1,
    "volume_rank": 1,
    "description": "<p>Invented in 2008 and launched in early 2009, Bitcoin introduced the world to the concept of cryptocurrency. Bitcoin was invented by someone using the pseudonym &ldquo;<a href=\"https://coincodex.com/article/48/who-is-or-who-are-satoshi-nakamoto/\" target=\"_blank\">Satoshi Nakamoto</a>&rdquo;, but it is still unclear whether this name represents one person or a group of people.</p>\n\n<p>Bitcoin started off as a niche interest for cryptography and technology enthusiasts and eventually exploded in popularity, with the BTC price growing to thousands of dollars.</p>\n\n<p>With Bitcoin&rsquo;s rise in value and adoption, the technology that makes Bitcoin possible was started being leveraged for a number of use cases, leading to the emergence of crypto assets as an asset class&mdash;practically every cryptocurrency on the market today employs some of the concepts introduced by Bitcoin.</p>\n\n<p>Here&rsquo;s a quick summary of some of Bitcoin&rsquo;s most important features:</p>\n\n<ul>\n\t<li>The first decentralized digital currency</li>\n\t<li>Extremely high security due to proof-of-work and blockchain design</li>\n\t<li>Fully transparent history of transactions and predictable supply timeline</li>\n\t<li>Only 21 million BTC coins will ever be created</li>\n\t<li>Fully permissionless, anyone can participate in the network and send transactions</li>\n</ul>\n\n<h3>What is Bitcoin and how does it work?</h3>\n\n<p>Bitcoin is a peer-to-peer system that allows users to transfer value between each other without requiring a trusted third party to act as an intermediary. The design of the Bitcoin protocol prevents double spending and the arbitrary creation of new coins.</p>\n\n<p>Bitcoin transactions are recorded in a fully transparent public ledger called the blockchain. Approximately every 10 minutes, Bitcoin transactions are batched into a &ldquo;block&rdquo; and added to the ledger. The blocks reference each other&mdash;this is where the &ldquo;chain&rdquo; part of blockchain comes from.</p>\n\n<p>In order to ensure the security of the network, Bitcoin uses a <a href=\"https://coincodex.com/article/2469/what-is-proof-of-work-pow/\" target=\"_blank\">Proof-of-Work algorithm</a>. The process of facilitating transactions and creating new coins is referred to as &ldquo;mining&rdquo;. Miners deploy their computers to solve resource-intensive mathematical problems&mdash;the miner that reaches the correct solution first has the privilege of adding the next block to the Bitcoin blockchain and receives a reward in the form of BTC for their trouble.</p>\n\n<p>The more computing power that&rsquo;s used for mining Bitcoin, the more robust the network becomes, as it becomes increasingly difficult for a single entity to intentionally promote invalid transactions or re-arrange the history of the ledger.</p>\n\n<p>The Bitcoin network is permissionless, which means that anyone can become a miner and participate in its consensus process. Everyone is also free to install a Bitcoin client and operate their own node on the Bitcoin network.</p>\n\n<h3>Bitcoin price history</h3>\n\n<p>The price of Bitcoin has seen <a href=\"https://coincodex.com/article/13646/11-years-ago-bitcoin-surpassed-1-milestone-for-the-first-time-ever/\" target=\"_blank\">big changes</a> since BTC was first launched in 2009. Initially, Bitcoin didn&rsquo;t really have an established price, and most people who owned BTC obtained it through mining. Eventually, a growing number of people became interested in Bitcoin, and began buying coins from other holders. Initially, these purchases were facilitated directly between buyers and sellers through web forums like Bitcoin Talk.</p>\n\n<p>Eventually, <a href=\"https://coincodex.com/crypto/bitcoin/exchanges/\" target=\"_blank\">Bitcoin exchanges</a> were created and offered a more streamlined and automated way of buying and selling Bitcoin. One of the first ever Bitcoin exchanges was Bitcoin Market, which launched in 2010. Bitcoin Market and other platforms established a public market for Bitcoin, making it possible to track the price of BTC as expressed in US dollars and other currencies. The first price of Bitcoin was $0.07, according to CoinCodex data, which tracks the Bitcoin price starting from August 2010.</p>\n\n<p>Let&rsquo;s take a look at the <a href=\"https://coincodex.com/crypto/bitcoin/historical-data/\" target=\"_blank\">historical Bitcoin price</a> chart and highlight some important milestones:</p>\n\n<ul>\n\t<li>$0.10 &ndash; The Bitcoin price first surpassed $0.10 in October of 2010</li>\n\t<li>$1 &ndash; The first time that Bitcoin was worth $1 was in February of 2011</li>\n\t<li>$10 &ndash; The first time that the BTC price climbed over $10 was in August 2012</li>\n\t<li>$100 &ndash; The first time that Bitcoin was worth more than $100 was in April 2013</li>\n\t<li>$1,000 &ndash; Bitcoin surpassed $1,000 for the first time in its history in December 2013</li>\n\t<li>$10,000 &ndash; Bitcoin reached $10,000 for the first time in December 2017</li>\n\t<li>$20,000 &ndash; Bitcoin reached $20,000 for the first time in December 2020</li>\n\t<li>$30,000 &ndash; The first time Bitcoin reached $30,000 was in January 2021</li>\n\t<li>$40,000 &ndash; The first time Bitcoin reached $40,000 was in January 2021</li>\n\t<li>$50,000 &ndash; Bitcoin first reached the $50,000 price level in February 2021</li>\n\t<li>$60,000 &ndash; The first time Bitcoin reached $60,000 was in April 2021</li>\n</ul>\n\n<h3>Bitcoin Supply</h3>\n\n<p>The Bitcoin protocol specifies that no more than 21 million BTC can exist. However, each BTC can be subdivided into 100 million units called satoshis. One satoshi is the smallest unitof Bitcoin that can exist. Satoshis are commonly referred to as &ldquo;sats&rdquo; by cryptocurrency fans.</p>\n\n<p>With the price of Bitcoin increasing so much in the last decade, most investors cannot afford to purchase a whole BTC. Thankfully, this isn&rsquo;t really a problem if you&rsquo;re looking to <a href=\"https://coincodex.com/article/1875/how-to-buy-bitcoin-btc-on-binance/\" target=\"_blank\">buy Bitcoin</a>&mdash;since BTC can be subdivided to very small units, <a href=\"https://www.coincodex.com/article/2588/do-i-have-to-buy-a-whole-bitcoin/\" target=\"_blank\">you don&#39;t have to buy a whole BTC</a> to begin investing in Bitcoin. Depending on the cryptocurrency exchange you&rsquo;re using, you can buy as little as <a href=\"https://coincodex.com/convert/usd/bitcoin/1/\" target=\"_blank\">$1 worth of Bitcoin</a>, or even less.</p>\n\n<h4>Bitcoin halvings</h4>\n\n<p>The BTC coin reward received by Bitcoin miners is cut in half approximately every 4 years in what are known as <a href=\"https://coincodex.com/article/3693/what-is-the-bitcoin-halving/\" target=\"_blank\">Bitcoin halvings</a>. The last Bitcoin will be mined <a href=\"https://coincodex.com/article/2401/when-will-the-last-bitcoin-be-mined/\" target=\"_blank\">around the year 2140</a>, according to estimates. Here is how the BTC reward earned by miners is changing over time:</p>\n\n<ul>\n\t<li>2009 &ndash; 2012: 50 BTC per block</li>\n\t<li>2012 &ndash; 2016: 25 BTC per block</li>\n\t<li>2016 &ndash; 2020: 12.5 BTC per block&nbsp;&nbsp; &nbsp;</li>\n\t<li>2020 &ndash; 2024: 6.25 BTC per block</li>\n\t<li>2024 &ndash; 2028: 3.125 BTC per block</li>\n</ul>\n\n<h3>Bitcoin Market Cap</h3>\n\n<p>One of the ways that we can measure the growth of Bitcoin is by taking a look at its market capitalization (commonly abbreviated to &ldquo;market cap&rdquo;). Calculating the Bitcoin market cap is fairly straightforward, as we simply have to multiply the amount of BTC coins in circulation with the current price of one BTC. This gives us a rough estimate of the size of the Bitcoin market, and also provides a helpful way to compare how large Bitcoin is compared to other cryptocurrencies.&nbsp;</p>\n\n<p>The market capitalization of Bitcoin can change significantly as the BTC market goes through its various cycles. The Bitcoin market cap surpassed $1 trillion for the first time in February 2021.</p>\n\n<p>Market cap is also used to measure the size of companies&mdash;we can calculate the market cap of a company by multiplying the price of one share by the total amount of outstanding shares. Even though market cap can come in hady to make comparisons, it&rsquo;s far from a perfect metric. For example, directly comparing a cryptocurrency and a stock by their market cap is probably not the best idea due to the fundamental differences between the two markets.</p>\n\n<h4>What is Bitcoin dominance?</h4>\n\n<p><a href=\"/article/19052/what-is-bitcoin-dominance\" target=\"_blank\">Bitcoin dominance</a> is a measure of Bitcoin&rsquo;s share of the <a href=\"/market-overview/\" target=\"_blank\">total crypto market cap</a>. The metric is derived from dividing the total value of all digital assets in circulation by the market capitalization of Bitcoin. Historically, Bitcoin has always controlled the largest share of the crypto market. However, with the rise of new digital currencies since Bitcoin&rsquo;s first block in 2009, Bitcoin dominance has fallen from 100% in 2013, and 88% in 2014, to just 38% in 2022.&nbsp;</p>\n\n<p>A high Bitcoin dominance ratio typically infers altcoins are doing poorly in the market, or at the very least poorly when compared with Bitcoin. In contrast, a low BTC dominance figure means that alternative digital assets, including <a href=\"https://coincodex.com/crypto/ethereum/\" target=\"_blank\">Ethereum</a> and all other coins that are not Bitcoin, are performing well against the world&rsquo;s oldest crypto.</p>\n\n<h3>The most important Bitcoin milestones</h3>\n\n<p>The history of Bitcoin is full of ups and downs. Here are some of the most important events and developments that have <a href=\"https://coincodex.com/article/9871/the-story-of-bitcoin-12-years-after-the-bitcoin-whitepaper/\" target=\"_blank\">played a defining role</a> in the story of the world&rsquo;s biggest cryptocurrency.</p>\n\n<ul>\n\t<li>October 2008 &ndash; Satoshi Nakamoto publishes the <a href=\"https://bitcoin.org/bitcoin.pdf\" rel=\"nofollow noopener\" target=\"_blank\">Bitcoin whitepaper</a></li>\n\t<li>January 2009 &ndash; The first block of the Bitcoin blockchain, also known as the &ldquo;genesis block&rdquo;, is mined</li>\n\t<li>May 2010 &ndash; A Bitcoin Talk forum user <a href=\"https://coincodex.com/article/3661/happy-bitcoin-pizza-day-its-been-9-years-since-the-famous-10000-btc-transaction/\" target=\"_blank\">pays 10,000 BTC for two pizzas</a>, which was the first documented purchase of a good with Bitcoin</li>\n\t<li>April 2011 &ndash; Satoshi Nakamoto confirms he stepped away from the Bitcoin project</li>\n\t<li>October 2013 &ndash; Silk Road, a dark web marketplace where Bitcoin was used for payments, is shut down by the FBI</li>\n\t<li>February 2014 &ndash; Mt.Gox, the &nbsp;&nbsp; &nbsp;largest Bitcoin exchange at the time, collapses following a series &nbsp;&nbsp; &nbsp;of hacks</li>\n\t<li>August 2017 &ndash; A community dispute over Bitcoin&rsquo;s block size leads to a hard fork of the &nbsp;&nbsp; &nbsp;Bitcoin blockchain, resulting in Bitcoin Cash</li>\n\t<li>February 2021 &ndash; Tesla <a href=\"https://coincodex.com/article/10543/breaking-tesla-buys-15-billion-worth-of-bitcoin-and-starts-accepting-btc-for-products/\" target=\"_blank\">buys</a> $1.5 billion worth of Bitcoin</li>\n</ul>\n\n<h3>Who&rsquo;s in charge of Bitcoin?</h3>\n\n<p>Bitcoin doesn&rsquo;t have a CEO, a headquarters, or a company that&rsquo;s in charge of it. It&rsquo;s a protocol consisting of users running software that conforms to the protocol&rsquo;s rules. Developers across the globe are constantly working on improvements to the Bitcoin protocol, with the most prominent project being the Bitcoin Core client. Any modifications to the protocol have to be accepted by participants in the Bitcoin network &ndash; if a proposed change is unpopular, miners and node operators simply won&rsquo;t run the proposed new version of the software.</p>\n\n<p>Even Satoshi Nakamoto, the inventor of Bitcoin, would not be able to force through any changes to the Bitcoin protocol if there was a lack of consensus amongst participants in the Bitcoin network. While nobody is in charge of Bitcoin, a number of individuals have made significant contributions to the project over the years. This includes Gavin Andresen, who served as Bitcoin&rsquo;s lead developer starting with 2011. Andresen also founded the Bitcoin Foundation in 2012 to support the development of Bitcoin. Other developers like Wladimir J. van der Laan, Marco Falke, Pieter Wuille, Michael Ford and Jonas Schnelli are listed among the top contributors on the Bitcoin Core GitHub.</p>\n\n<h3>What is the Lightning Network?</h3>\n\n<p>If you&rsquo;ve been following Bitcoin recently, you&rsquo;ve probably heard of the <a href=\"https://coincodex.com/article/1124/what-is-the-lightning-network/\" target=\"_blank\">Lightning Network</a>&mdash;it&rsquo;s one of the most exciting projects in the Bitcoin ecosystem at the moment. The Lightning Network addresses Bitcoin&rsquo;s limited scalability by introducing a layer on top of the Bitcoin blockchain that can handle transactions at much higher speeds and lower costs.&nbsp;</p>\n\n<p>By itself, the Bitcoin network can handle less than 10 transactions per second, which limits its use as a currency on a global scale. The network also isn&rsquo;t suitable for sending very small payments (microtransactions), as transaction fees can be higher than the value of the payment itself. The Lightning Network allows users to establish payment channels that use smart contracts to process transactions outside of the main Bitcoin blockchain. Only the opening and closing of payment channels is broadcasted to the Bitcoin blockchain. When a channel is closed, the users&rsquo; BTC balances are settled on the Bitcoin blockchain. The Lightning Network was first proposed by Joseph Poon and Thaddeus Dryja in 2015, and the protocol has been making steady advances in recent years. Services like Strike simplify the process of making BTC payments via the Lightning Network, and the protocol is also being adopted by a growing number of cryptocurrency exchanges for Bitcoin withdrawals and deposits. &nbsp;</p>\n",
    "price_high_24_usd": 71368,
    "price_low_24_usd": 68633.19,
    "start": null,
    "end": null,
    "is_promoted": null,
    "message": "<p class=\"message\">Bitcoin is featured as the #1 crypto for long-term investors. <a target=\"_blank\" href=\"https://coincodex.com/article/22417/best-long-term-crypto/\">Read more &raquo;</a>",
    "website": "https://bitcoin.org/",
    "whitepaper": "https://bitcoin.org/bitcoin.pdf",
    "total_supply": "21000000",
    "supply": 19704150,
    "platform": "BTC",
    "how_to_buy_url": null,
    "last_price_usd": 71291.17,
    "price_change_1H_percent": 0.2549,
    "price_change_1D_percent": 3.2094,
    "price_change_7D_percent": 3.9324,
    "price_change_30D_percent": 10.9135,
    "price_change_90D_percent": 8.1173,
    "price_change_180D_percent": 64.1781,
    "price_change_365D_percent": 176.648,
    "price_change_3Y_percent": 98.0546,
    "price_change_5Y_percent": 801.652,
    "price_change_ALL_percent": 142582000,
    "price_change_YTD_percent": 68.766,
    "volume_24_usd": 106456653824,
    "trading_since": "2024-06-05 07:53:21",
    "stages_start": null,
    "stages_end": null,
    "include_supply": "true",
    "use_volume": "true",
    "ath_usd": 73628.4,
    "ath_date": "2024-03-14 07:05:00",
    "not_trading_since": "2024-06-05 07:53:21",
    "last_update": "2024-06-05 07:52:33",
    "cycle_low_usd": 56721,
    "cycle_high_usd": 71739.1,
    "cycle_low_date": "2024-05-01 15:20:00",
    "cycle_high_date": "2024-05-21 00:20:00",
    "image_id": "b9469e27-476b-4fc8-0d5e-9a9e51581400",
    "image_t": "b9469e27-476b-4fc8-0d5e-9a9e51581400",
    "total_total_supply": "19704150",
    "initial_data": {
        "date": "2024-06-05 07:53:21",
        "price_usd": "0.05",
        "price_btc": "1",
        "price_eth": "0"
    },
    "ath_data": {
        "ath_usd": 73628.4,
        "ath_usd_date": "2024-03-14 07:05:00",
        "ath_btc": 1,
        "ath_btc_date": "2024-03-14 07:05:00",
        "ath_eth": 679.466,
        "ath_eth_date": "2015-11-04 13:35:00"
    },
    "atl_data": {
        "atl_usd": 0.05,
        "atl_usd_date": "2010-07-17 00:00:00",
        "atl_btc": 1,
        "atl_btc_date": "2024-03-14 07:05:00",
        "atl_eth": 6.50627,
        "atl_eth_date": "2017-06-13 01:40:00"
    },
    "social": {
        "Bitcointalk": "https://bitcointalk.org",
        "Explorer": "http://blockchain.info",
        "Explorer1": "https://blockstream.info/",
        "Explorer2": "https://live.blockcypher.com/btc/",
        "Explorer3": "https://blockchair.com/bitcoin",
        "Reddit": "https://www.reddit.com/r/bitcoin"
    },
    "socials": [
        {
            "name": "Bitcointalk",
            "value": "https://bitcointalk.org",
            "label": "",
            "coincodex_socials_id": 8
        },
        {
            "name": "Explorer",
            "value": "http://blockchain.info",
            "label": "Blockchain Info",
            "coincodex_socials_id": 13
        },
        {
            "name": "Explorer",
            "value": "https://blockstream.info/",
            "label": "Blockstream",
            "coincodex_socials_id": 13
        },
        {
            "name": "Explorer",
            "value": "https://live.blockcypher.com/btc/",
            "label": "Blockcypher",
            "coincodex_socials_id": 13
        },
        {
            "name": "Explorer",
            "value": "https://blockchair.com/bitcoin",
            "label": "Blockchair",
            "coincodex_socials_id": 13
        },
        {
            "name": "Reddit",
            "value": "https://www.reddit.com/r/bitcoin",
            "label": "",
            "coincodex_socials_id": 2
        }
    ]
}