{
    "symbol": "ADA",
    "coin_name": "Cardano",
    "shortname": "cardano",
    "slug": "cardano",
    "display_symbol": "ADA",
    "display": "true",
    "release_date": "2017-09-01",
    "ico_price": "0.002400000",
    "today_open": 0.732505163,
    "market_cap_rank": 8,
    "volume_rank": 23,
    "description": "<p>Cardano is a blockchain project building a framework for smart contracts and <a href=\"/article/2174/what-are-dapps/\" target=\"_blank\">decentralized applications</a> (dApps) with a focus on advanced functionality and scalability. The native asset of the Cardano blockchain is called ADA, which can be used for on-chain value transfers like the vast majority of other digital assets. The maximum supply of ADA is artificially capped at 45 billion coins.&nbsp;</p>\n\n<p>Cardano&rsquo;s public chain is open-source and decentralized. The network uses the <a href=\"/article/7142/what-is-proof-of-stake/\" target=\"_blank\">Proof-of-Stake</a> (PoS) algorithm to achieve a consensus about the state of the ledger. The project was launched in 2017 by Charles Hoskinson, a co-founder of <a href=\"https://coincodex.com/crypto/ethereum/\" target=\"_blank\">Ethereum</a>.</p>\n\n<h4><strong>Here&rsquo;s a quick overview of key facts about Cardano and its core blockchain features:</strong></h4>\n\n<ul>\n\t<li>Cardano was launched in 2017, two years after initial development began in 2015 by Ethereum co-founder Charles Hoskinson</li>\n\t<li>In order to fund development, the Cardano project raised $62.2 million in an <a href=\"/article/2520/what-is-an-ico/\" target=\"_blank\">initial coin offering</a> (ICO) that was completed in January of 2017.&nbsp;</li>\n\t<li>Cardano is a blockchain platform designed to run for smart contracts and decentralized applications&nbsp;</li>\n\t<li>The Cardano network is based on a unique Ouroboros Proof-of-Stake consensus mechanism</li>\n\t<li>IOHK, Cardano Foundation, and Emurgo are the main organizations in the Cardano ecosystem</li>\n\t<li>The Cardano network consists of the Cardano Settlement Layer (CSL) and the Cardano Computational Layer (CCL)</li>\n\t<li>Cardano is one of the leading blockchain projects in the industry, boasting a multi-billion dollar market cap and hundreds of apps running on its chain</li>\n</ul>\n\n<h3>What is Cardano and how does it work?</h3>\n\n<p>Cardano is based on the principles of scalability, interoperability, and regulatory compliance. It was launched as an alternative to <a href=\"https://coincodex.com/crypto/bitcoin/\" target=\"_blank\">Bitcoin</a>&rsquo;s relatively poor network performance and Ethereum&rsquo;s lack of scalability.&nbsp;</p>\n\n<p>The Cardano network consists of two core layers. The Cardano Settlement Layer (CSL) keeps track of transactions and features Cardano&rsquo;s native token ADA as the primary unit of currency. The Cardano Computational Layer (CCL) featuring the Plutus platform is responsible for running smart contracts and dApps and functions similar to Ethereum.</p>\n\n<p>Cardano is known in the cryptocurrency community as an ambitious project with a rigorous approach to development &ndash; for example, the protocol&rsquo;s Ouroboros Proof-of-Stake consensus protocol has been subject to academic peer review. Thanks to its blockchain architecture, Cardano uses less than 0.01% of the energy consumed by Bitcoin, as reported by the University of Cambridge.</p>\n\n<p>For its smart contracts, Cardano uses a programming language called Haskell which provides significant security advantages over other programming languages used for smart contracts. Developers can leverage the capabilities of the Plutus platform and Haskell to build self-executing smart contracts and forge new tokens.&nbsp;</p>\n\n<p>The Cardano ecosystem is home to hundreds of blockchain projects, spanning decentralized exchanges (DEXs), wallets, <a href=\"/cryptocurrencies/sector/defi/\" target=\"_blank\">DeFi protocols</a>, NFT marketplaces, token launchpads, games, and several other categories.&nbsp;</p>\n\n<h3>Creation of Cardano</h3>\n\n<p>Cardano was initially envisioned by Charles Hoskinson, one of the initial founders of the Ethereum project. However, Hoskinson left Ethereum as he did not share the team&rsquo;s vision for the future direction of the project. After leaving Ethereum, Hoskinson founded IOHK, a blockchain infrastructure company and the primary developer of Cardano.</p>\n\n<p>While the initial development on Cardano started in 2015, it wasn&rsquo;t until 2017 that the network launched after raising more than $62 million in the ICO campaign. In total, the project held five separate fundraising events between 2015 and 2017 and sold nearly 30 billion ADA in the process.</p>\n\n<p>The Cardano project has three main arms which serve different functions within the ecosystem &ndash; the aforementioned IOHK, Cardano Foundation, and Emurgo. IOHK takes care of the technical development of the Cardano protocol, the Cardano Foundation promotes the adoption of Cardano, while Emurgo is primarily focused on commercial applications of Cardano&rsquo;s technology.</p>\n\n<p>Cardano&rsquo;s road map is divided into five major phases, with each focusing on a specific aspect of the Cardano protocol. Here are the phases listed from first to last:</p>\n\n<ul>\n\t<li>Byron (Foundation)</li>\n\t<li>Shelley (Decentralization)</li>\n\t<li>Goguen (Smart contracts)</li>\n\t<li>Basho (Scaling)</li>\n\t<li>Voltaire (Governance)</li>\n</ul>\n\n<p>After the successful completion of the goals set out in the five road map phases, Cardano will be a completely decentralized blockchain ecosystem, no longer under IOHK&rsquo;s management, and will feature advanced scaling and governance features on top of interoperable smart contracts.</p>\n\n<h3>Cardano Price History</h3>\n\n<p>Soon after first entering circulation following the ICO campaign, the price of Cardano has solidified the ADA token in the upper echelons of blockchain projects. ADA&rsquo;s early market success could be in large part attributed to the ICO craze of late 2017 and early 2018, which saw numerous tokens reaching multi-billion dollar valuations.</p>\n\n<p>During the ICO phase, roughly 25.9 billion ADA tokens were made available to investors participating with Bitcoin at the initial ADA token price of $0.0024. The Cardano team successfully hit its fundraising goal of $62,240,000. Shortly after it started trading, Cardano&rsquo;s price shoot up to $0.03 and went on to hit $1.20, valuing the project at almost $32 billion. Since then, the Cardano project retained its high ranking on the list of largest market cap digital currencies.</p>\n\n<p>Here are several key milestones in <a href=\"/crypto/cardano/historical-data/\" target=\"_blank\">Cardano&rsquo;s price history</a>:</p>\n\n<ul>\n\t<li>$0.0024 - Initial investors were able to obtain ADA with BTC during the ICO campaign at a sale price of $0.0024</li>\n\t<li>$0.0250 - The Cardano token price surpassed $0.0250 on the first trading day in early October 2017</li>\n\t<li>$0.1000 - The price of ADA surpassed $0.1000 in November 2017, showing more than 40x returns compared to its ICO price</li>\n\t<li>$0.5000 - Cardano price reached the $0.5000 price level in December 2017, two months after it started trading</li>\n\t<li>$1 - The first time that ADA reached $1 came in January 2018</li>\n\t<li>$2 - After a prolonged bear market between 2018 and 2020, the price of Cardano surpassed $2 in May 2021</li>\n\t<li>$3 - The price of ADA coin hit the $3 milestone in September 2021</li>\n</ul>\n\n<p>For a glimpse into a potential future ADA price movement in addition to the Cardano live price, you can follow our algorithmically generated <a href=\"/crypto/cardano/price-prediction/\" target=\"_blank\">Cardano price predictions</a> that take into account ADA&rsquo;s current price and a number of market indicators, including Fear &amp; Greed Index, market sentiment, overall volatility, and more. You can also check the up-to-date market rate of <a href=\"/convert/cardano/usd/\" target=\"_blank\">1 ADA to USD</a> via our handy crypto-to-fiat and crypto-to-crypto conversion feature.</p>\n\n<h3>Cardano Market Cap</h3>\n\n<p>The market capitalization of ADA shot well into the multi-billion dollar territory shortly after the token entered circulation in late 2017. Since then, Cardano has never relinquished its position among the largest market cap coins.&nbsp;</p>\n\n<p>Here&rsquo;s what the ADA market cap data tells us about the most notable Cardano market cap milestones:</p>\n\n<ul>\n\t<li>$500 million - &nbsp;The market cap of ADA surpassed a $500 in October 2017, shortly after its launch</li>\n\t<li>$5 billion - The ADA token market cap surpassed $5 billion in December 2017</li>\n\t<li>$10 billion - Cardano hit decacorn status in the final days of 2017</li>\n\t<li>$20 billion - The first time that the market cap of Cardano surpassed $20 billion was in January 2018</li>\n\t<li>$50 billion - &nbsp;The combined value of all ADA tokens in circulation reached $50 billion in June 2021</li>\n\t<li>90 billion - ADA&rsquo;s market cap surpassed $90 billion in August 2021</li>\n</ul>\n\n<h3>Cardano Supply</h3>\n\n<p>The supply of ADA tokens is capped at 45 billion, which is in principle similar to Bitcoin and its artificially capped supply of 21 million. The Cardano team has made 57.6% of the maximum token supply available in the initial coin offering, meaning that initial investors were able to obtain approximately 25.9 billion ADA in the token sale.&nbsp;</p>\n\n<p>The remaining 19.1 billion tokens, which represent 42.4% of the total ADA token supply, were reserved for staking rewards issued to network validators who are responsible for securing the network and generating new blockchain blocks. Since ADA has a fixed token supply, the cryptocurrency is subject to deflationary mechanics.</p>\n\n<h3>The most important Cardano milestones</h3>\n\n<p>Being one of the largest and most ambitious projects in the sector, Cardano has reached several notable milestones and forged a number of high-profile partnerships since the network launched in 2017. Here is a list of important dates and events in Cardano&rsquo;s eventful past:</p>\n\n<ul>\n\t<li>April 2015 - Charles Hoskinson and Jeremy Wood found IOHK, which grew to become one the largest blockchain engineering companies and the creator of Cardano</li>\n\t<li>September 2017 - The Cardano network launches on the heels of a successfully ICO campaign that raised more than $62 million worth of BTC</li>\n\t<li>December 2017 - Cardano&rsquo;s market cap surpassed $10 billion just five months after the initial mainnet launch</li>\n\t<li>June 2018 - Cardano developer IOHK partners with the Ethiopian government to explore education and infrastructure-related blockchain use cases</li>\n\t<li>October 2019 - Footwear manufacturing giant New Balance announces Cardano-based program to track the authenticity of its basketball shoes</li>\n\t<li>September 2021 - Plutus-powered smart contracts go live as a part of the Alonzo hard fork</li>\n</ul>\n\n<p>&nbsp;</p>\n",
    "price_high_24_usd": 0.796045206,
    "price_low_24_usd": 0.435613,
    "start": "2015-09-01 00:00:00",
    "end": "2017-01-31 23:59:00",
    "is_promoted": "false",
    "message": "",
    "website": "https://www.cardano.org/en/home/",
    "whitepaper": "https://resource.bnbstatic.com/books/20180205/1517836512923.pdf",
    "total_supply": "45000000000",
    "supply": 33820262543,
    "platform": "Cardano",
    "how_to_buy_url": null,
    "last_price_usd": 0.7542887408958903,
    "price_change_1H_percent": "1.182",
    "price_change_1D_percent": "4.5169",
    "price_change_7D_percent": "11.5506",
    "price_change_30D_percent": "51.4562",
    "price_change_90D_percent": "38.9923",
    "price_change_180D_percent": "197.462",
    "price_change_365D_percent": "133.127",
    "price_change_3Y_percent": "-32.5787",
    "price_change_5Y_percent": "1560.78",
    "price_change_ALL_percent": "2287.6",
    "price_change_YTD_percent": "25.3913",
    "volume_24_usd": 1651955840,
    "trading_since": "2017-10-01 20:45:00",
    "stages_start": "2015-09-01 00:00:00",
    "stages_end": "2017-01-31 23:59:00",
    "include_supply": "true",
    "use_volume": "true",
    "ath_usd": "3.09704",
    "ath_date": "2021-09-02 06:00:00",
    "not_trading_since": null,
    "last_update": "2024-03-07 19:03:29",
    "cycle_low_usd": 0.234392,
    "cycle_high_usd": 0.797962,
    "cycle_low_date": "2023-06-10 04:35:00",
    "cycle_high_date": "2024-03-04 10:05:00",
    "image_id": "770a05bf-08bd-4495-e49e-78b1bc47aa00",
    "cover_image_id": "56227444-a63d-4972-6e9c-22fa598d7700",
    "image_t": 1635175819,
    "total_total_supply": "45000000000",
    "initial_data": {
        "date": "2017-10-01 20:45:00",
        "price_usd": "0.0315919",
        "price_btc": "0.00000733287",
        "price_eth": "0.000105741"
    },
    "ath_data": {
        "ath_usd": 3.09704,
        "ath_usd_date": "2021-09-02 06:00:00",
        "ath_btc": 8.76375e-05,
        "ath_btc_date": "2018-01-04 13:00:00",
        "ath_eth": 0.00139173,
        "ath_eth_date": "2018-01-04 02:25:00"
    },
    "atl_data": {
        "atl_usd": 0.0173541,
        "atl_usd_date": "2017-10-01 22:45:00",
        "atl_btc": 2.58e-06,
        "atl_btc_date": "2017-11-02 10:25:00",
        "atl_eth": 5.70687e-05,
        "atl_eth_date": "2017-10-07 04:45:00"
    },
    "social": {
        "Explorer": "https://cardanoexplorer.com/",
        "Message Board": "https://cardanodocs.com/cardano/monetary-policy/",
        "Message Board1": "https://forum.cardanohub.org/",
        "Twitter": "https://twitter.com/CardanoStiftung",
        "Reddit": "https://www.reddit.com/r/cardano",
        "GitHub": "https://github.com/input-output-hk/cardano-sl/",
        "Chat": "https://chat.cardanohub.org/",
        "Facebook": "https://www.facebook.com/1610816175835862",
        "Explorer1": "https://blockchair.com/cardano",
        "Explorer2": "https://cexplorer.io/"
    },
    "socials": [
        {
            "name": "Explorer",
            "id": "385921",
            "coincodex_coin_symbol": "ADA",
            "coincodex_socials_id": "13",
            "value": "https://cardanoexplorer.com/",
            "label": "Cardano Explorer",
            "order_by": "0"
        },
        {
            "name": "Message Board",
            "id": "385923",
            "coincodex_coin_symbol": "ADA",
            "coincodex_socials_id": "14",
            "value": "https://cardanodocs.com/cardano/monetary-policy/",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Message Board",
            "id": "385925",
            "coincodex_coin_symbol": "ADA",
            "coincodex_socials_id": "14",
            "value": "https://forum.cardanohub.org/",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Twitter",
            "id": "385927",
            "coincodex_coin_symbol": "ADA",
            "coincodex_socials_id": "3",
            "value": "https://twitter.com/CardanoStiftung",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Reddit",
            "id": "385929",
            "coincodex_coin_symbol": "ADA",
            "coincodex_socials_id": "2",
            "value": "https://www.reddit.com/r/cardano",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "GitHub",
            "id": "385931",
            "coincodex_coin_symbol": "ADA",
            "coincodex_socials_id": "9",
            "value": "https://github.com/input-output-hk/cardano-sl/",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Chat",
            "id": "385933",
            "coincodex_coin_symbol": "ADA",
            "coincodex_socials_id": "15",
            "value": "https://chat.cardanohub.org/",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Facebook",
            "id": "385935",
            "coincodex_coin_symbol": "ADA",
            "coincodex_socials_id": "7",
            "value": "https://www.facebook.com/1610816175835862",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Explorer",
            "id": "385937",
            "coincodex_coin_symbol": "ADA",
            "coincodex_socials_id": "13",
            "value": "https://blockchair.com/cardano",
            "label": "Blockchair",
            "order_by": "0"
        },
        {
            "name": "Explorer",
            "id": "385939",
            "coincodex_coin_symbol": "ADA",
            "coincodex_socials_id": "13",
            "value": "https://cexplorer.io/",
            "label": "Cexplorer",
            "order_by": "0"
        }
    ]
}