{
    "symbol": "SOL",
    "coin_name": "Solana",
    "shortname": "solana",
    "slug": "solana",
    "display_symbol": "SOL",
    "display": "true",
    "release_date": "2020-03-24",
    "ico_price": "0.220000000",
    "today_open": 130.5801,
    "market_cap_rank": 5,
    "volume_rank": 7,
    "description": "<p>Solana is a high-performance permissionless blockchain using the <a href=\"/article/7142/what-is-proof-of-stake/\" target=\"_blank\">Proof-of-Stake</a> (PoS) consensus algorithm in conjunction with the Proof-of-History (PoH) mechanism to achieve high throughput without sacrificing the network&#39;s security. Theoretically, Solana&rsquo;s blockchain architecture could facilitate up to 710K transactions per second (TPS).</p>\n\n<p>Due to the exceedingly high throughput, low fees, and sub-second average block time, the Solana blockchain has emerged as one of the most popular platforms for <a href=\"/article/2354/what-are-non-fungible-tokens-nfts/\" target=\"_blank\">non-fungible token</a> (NFT) and <a href=\"/article/2174/what-are-dapps/\" target=\"_blank\">decentralized application</a> (dApps) use cases, making it one of the primary competitors to <a href=\"https://coincodex.com/crypto/ethereum/\" target=\"_blank\">Ethereum</a>.</p>\n\n<p><strong>Here&rsquo;s a quick overview of key facts about Solana and its core blockchain features:</strong></p>\n\n<ul>\n\t<li>Solana is a smart contract blockchain network that allows users to deploy decentralized applications and launch fungible as well as non-fungible tokens</li>\n\t<li>The network was launched in March 2020 after a series of private and public token sales raised over $25 million</li>\n\t<li>The network boasts sub-second transaction finality, low fees, and a theoretical output of more than 700,000 TPS</li>\n\t<li>Solana uses Proof-of-Stake along with a Proof-of-History consensus algorithm to facilitate and verify transactions</li>\n\t<li>The Solana network is powered by the SOL token, which is the network&rsquo;s native utility token used for gas fee payments and staking purposes</li>\n\t<li>Ukrainian-born software engineer Anatoly Yakovenko first envisioned Solana in late 2017</li>\n</ul>\n\n<h3>What is Solana and how does it work?</h3>\n\n<p>Solana is a smart contract blockchain network launched in March 2020, following an <a href=\"/article/2520/what-is-an-ico/\" target=\"_blank\">initial coin offering</a> (ICO) that raised $1.76 million. Solana has emerged as one of the fastest blockchain systems in the industry, using a combination of PoS and PoH consensus mechanisms to reach a congruence about the state of the ledger among network participants.</p>\n\n<p>Proof-of-History is a cryptographic technique that uses the passage of time between two events to produce timestamps which can be used to verify the state of the ledger before new blocks are generated, according to the project&rsquo;s <a href=\"https://solana.com/solana-whitepaper.pdf\" rel=\"nofollow noopener\" target=\"_blank\">whitepaper</a>. While sporting several benefits, such as a high degree of security and fast verification times, PoH has several disadvantages as well. Namely, running PoH requires a lot of computational powers, which restricts the number of potential node validators and makes the network more centralized than some of its smart contract counterparts.</p>\n\n<p>The primary digital asset used as a medium of exchange on the network is the Solana (SOL) token. SOL is not the only digital currency issued on the Solana chain, as the network allows for the creation of new tokens, as long as they follow the guidelines outlined in the Solana Program Library (SPL). For more information about the topic, skip to the &ldquo;SPL Tokens&rdquo; section below.</p>\n\n<p>Via a process known as Delegated Proof-of-Stake (DPoS), anyone who owns SOL tokens can choose to delegate (hence the name) some of their SOL to vote for validators who participate in the process of facilitating transactions on the network.</p>\n\n<p>Solana&rsquo;s unique approach to blockchain consensus and the high transactional throughput associated with it, catapulted the network to become one of the most successful Ethereum competitors. In the few years since its launch, the Solana network has become a hotbed of NFT activity, new token and dApp launches, and more.&nbsp;</p>\n\n<h3>Creation of Solana</h3>\n\n<p>The original idea for Solana dates to 2017, when the Ukrainian-born software engineer and co-founder Anatoly Yakovenko published an initial whitepaper draft describing a timekeeping process for decentralized computational systems. He named the process Proof-of-History.</p>\n\n<p>In 2018, after partnering with Qualcomm&#39;s Greg Fitzgerald &ndash; who later became Solana&#39;s principal architect and CTO &ndash; the work on the first ever PoH blockchain switched into a higher gear. A testnet demo and the finalized version of the Solana whitepaper were released in February 2018.</p>\n\n<p>With a working testnet and a growing team of developers on the Solana Labs team, the fundraising effort started in the second half of 2018. By the summer of 2019, more than $20 million was raised in a series of private token sales.&nbsp;</p>\n\n<p>After Solana&rsquo;s first public testnet &ndash; Tour de SOL &ndash; went live in 2020, and $1.76 million was raised during the ICO campaign on CoinList, the Solana protocol was ready for a mainnnet beta launch in March 2020.&nbsp;</p>\n\n<p>The work on the Solana network is primarily done by Solana Labs and the Solana Foundation. The former oversees the technical development side of things, while the latter is responsible for funding and community-building efforts.</p>\n\n<h4>SPL Tokens, Solana&rsquo;s equivalent to Ethereum&rsquo;s ERC-20 token standard</h4>\n\n<p>According to the official documentation, the Solana Program Library (SPL) is a collection of on-chain protocols running on Sealevel, Solana&rsquo;s parallel smart contracts runtime. Similar to what Ethereum has done with <a href=\"/article/56/what-are-erc-20-tokens/\" target=\"_blank\">ERC-20</a> &ndash; a token standard featuring rules for fungible tokens issued on the Ethereum platform &ndash; Solana has done with the implementation of SPL.</p>\n\n<p>SPL tokens are digital currencies that live on Solana&rsquo;s network. Each token transaction&rsquo;s gas fee is paid with SOL. The token program is written in the Rust programming language and allows developers to create digital currencies that follow Solana&rsquo;s transaction, token wrapping, minting, burning, staking, and creation guidelines.</p>\n\n<p>In addition to fungible tokens, the SPL token standard allows for the creation of non-fungible tokens as well. Both fungible and NFTs must follow wallet integration and account-specific rules outlined in the Solana Program Libary <a href=\"https://spl.solana.com/\" rel=\"nofollow noopener\" target=\"_blank\">documentation</a>.</p>\n\n<p>Next to SOL, the list of the largest market cap token on Solana includes <a href=\"https://coincodex.com/crypto/tether/\" target=\"_blank\">Tether</a>, <a href=\"https://coincodex.com/crypto/usd-coin/\" target=\"_blank\">USD Coin</a>, <a href=\"https://coincodex.com/crypto/serum/\" target=\"_blank\">Serum</a>, <a href=\"https://coincodex.com/crypto/constitutiondao/\" target=\"_blank\">ConstitutionDAO</a>, and <a href=\"https://coincodex.com/crypto/raydium/\" target=\"_blank\">Raydium</a>, to name a few.</p>\n\n<h3>Solana Price History</h3>\n\n<p>Soon after first becoming broadly available to cryptocurrency investors, the price of Solana skyrocketed. Although the crypto launched in 2020, the price of SOL quickly elevated Solana past some of the most well-known and long-established projects in the market cap standings.</p>\n\n<p>The Solana team raised $25.5 million in token sales held between April 2018 and March 2020. Only a single token sale was available to the public, with the remaining four reserved for private investors. In total, 185 million tokens out of the initial supply of 500 million tokens were sold in token sales, with the price ranging from as low as $0.04 to as high as $0.25 per SOL token.</p>\n\n<p>Here is what the <a href=\"/crypto/solana/historical-data/\" target=\"_blank\">historical SOL price data</a> tells us about key milestones in the token&rsquo;s price history:</p>\n\n<ul>\n\t<li>$0.22 - Initial investors were able to obtain SOL with USD and USDC during the ICO campaign &ndash; <a href=\"/ieo/solana/\" target=\"_blank\">8 million SOL tokens were offered at an initial sale price of $0.22</a> in late March 2020</li>\n\t<li>$0.80 - The Solana token price surpassed $0.80 on the first trading day in mid-April 2020</li>\n\t<li>$2 - The price of SOL surpassed $2 in July 2020, showing roughly 10x returns compared to its ICO price</li>\n\t<li>$5 - Solana price reached the $5 price level in early February 2021, half a year after it started trading</li>\n\t<li>$10 - The first time that the SOL token price reached $10 came in late February 2021</li>\n\t<li>$20 - The price of Solana surpassed $20 in March 2021 during a broader crypto bull market</li>\n\t<li>$100 - Solana claimed the three-figure price point for the first time in August 2021</li>\n\t<li>$250 - SOL hit the $250 price milestone in November 2021, during a bullish run that saw many digital currencies reach their ATH valuations</li>\n</ul>\n\n<p>For a glimpse into potential future SOL price movements in addition to the Solana live price, you can follow our algorithmically generated <a href=\"/crypto/solana/price-prediction/\" target=\"_blank\">Solana price predictions</a> that take into account SOL&rsquo;s current price and a number of market indicators, including Fear &amp; Greed Index, market sentiment, overall volatility, and more. You can also check the up-to-date market rate of <a href=\"/convert/solana/usd/\" target=\"_blank\">1 SOL to USD</a> via our handy crypto-to-fiat and crypto-to-crypto conversion feature.</p>\n\n<h3>Solana Market Cap</h3>\n\n<p>The market cap of Solana stood at about $110 million at the time of the project&rsquo;s Dutch-type token sale when accounting for the fully diluted supply and the ICO price of $0.22 per token. The market cap shot well into the multibillion territory shortly after the token started trading on <a href=\"/exchange/binance/\" target=\"_blank\">Binance</a>, <a href=\"/exchange/coinbase-pro/\" target=\"_blank\">Coinbase</a>, and other major <a href=\"/exchanges/\" target=\"_blank\">crypto exchanges</a>.&nbsp;</p>\n\n<p>Here&rsquo;s what the historical SOL price charts tell us about the crypto&rsquo;s most notable market cap milestones:</p>\n\n<ul>\n\t<li>$100 million - &nbsp;SOL&rsquo;s market cap surpassed the $100 million mark in August 2020, roughly four months after the token first started trading</li>\n\t<li>$1 billion - The market cap of SOL surpassed $1 billion in January 2021</li>\n\t<li>$10 billion - Solana hit decacorn status in April 2021, amidst a broader crypto market bull run</li>\n\t<li>$20 billion - The first time that Solana coin&rsquo;s market cap surpassed $20 billion was in August 2021</li>\n\t<li>$50 billion - &nbsp;The combined value of all SOL tokens in circulation reached $50 billion in September 2021</li>\n</ul>\n\n<h3>Solana Supply</h3>\n\n<p>Solana features an inflationary monetary policy, which means that both the total and circulating supply of SOL is slated to increase over time. When Solana launched it had an initial maximum supply of <a href=\"/convert/solana/usd/500000000/\" target=\"_blank\">500 million SOL tokens</a>. However, according to Solana&#39;s documentation pertaining to the inflation schedule, the total supply of Solana is slated to increase past 750 million tokens in the 15th year of its existence (in 2035).&nbsp;</p>\n\n<p>According to the Solana Foundation&#39;s proposal, the team envisions a long-term inflation rate of 1.5% (defined as the annualized growth rate of the total current supply at any point in time). The long-term inflation rate target is expected to come into effect gradually over ten years, starting with an initial rate of 8% in 2020 and falling to 1.5% by 2030.</p>\n\n<p>The inflationary mechanics allow new SOLs to be issued via staking rewards, which incentivizes SOL stakers to use their tokens to secure the network and validate transactions and smart contract operations.&nbsp;</p>\n\n<p>It is worth noting that a large number of SOL tokens that were allocated to the founders when the token launched (12.5% of the initial 500 million token supply) are vested. They are slated to be released from their nearly three-year long lockup period in January 2023.</p>\n\n<h3>The most important Solana milestones</h3>\n\n<p>Despite being a relative newcomer to the cryptocurrency scene, Solana has made significant strides since its 2020 launch and reached several major milestones in the meantime. Here is a list of important dates and events from Solana&rsquo;s eventful past:</p>\n\n<ul>\n\t<li>November 2017 - Co-founder Anatoly Yakovenko publishes an initial whitepaper detailing a new timekeeping technique for decentralized networks dubbed Proof-of-History (PoH)</li>\n\t<li>February 2018 - First Solana internal testnet and official whitepaper get released after &nbsp;Greg Fitzgerald partners with Yakovenko</li>\n\t<li>March 2020 - The &ldquo;Genesis&rdquo; block is created</li>\n\t<li>June 2021 - Solanart becomes the first NFT marketplace deployed on the Solana blockchain</li>\n\t<li>September 2021 - <a href=\"https://www.bloomberg.com/news/articles/2021-09-06/token-of-ethereum-rival-solana-jumps-to-seventh-in-crypto-top-10\" rel=\"nofollow noopener\" target=\"_blank\">Bloomberg</a> proclaims Solana as a &ldquo;long-term rival&rdquo; of Ethereum due to the network&rsquo;s high throughput and low costs</li>\n\t<li>December 2021 - Melania Trump, the former First Lady of the US, announces plans to launch its NFT collection using Solana</li>\n\t<li>May 2022 - The Solana network experiences a <a href=\"/article/15066/solana-halted-production-of-new-blocks-due-to-a-consensus-failure-sol-drops-over-10/\" target=\"_blank\">series of power outages</a> caused by consensus issues and NFT-induced network congestion</li>\n</ul>\n",
    "price_high_24_usd": 90.668227146,
    "price_low_24_usd": 24.5596,
    "start": "2018-04-05 00:00:00",
    "end": "2020-03-24 11:00:00",
    "is_promoted": "false",
    "message": "",
    "website": "https://solana.com/",
    "whitepaper": "https://solana.com/solana-whitepaper.pdf",
    "total_supply": "533682177",
    "supply": 443011942,
    "platform": "SOL",
    "how_to_buy_url": null,
    "last_price_usd": 148.8108,
    "price_change_1H_percent": "1.7593",
    "price_change_1D_percent": "14.7191",
    "price_change_7D_percent": "15.0435",
    "price_change_30D_percent": "55.7716",
    "price_change_90D_percent": "103.31",
    "price_change_180D_percent": "661.085",
    "price_change_365D_percent": "677.557",
    "price_change_3Y_percent": "990.037",
    "price_change_5Y_percent": "22336.6",
    "price_change_ALL_percent": "22336.6",
    "price_change_YTD_percent": "43.1906",
    "volume_24_usd": 13408541696,
    "trading_since": "2020-04-09 08:45:00",
    "stages_start": "2018-04-05 00:00:00",
    "stages_end": "2020-03-24 11:00:00",
    "include_supply": "true",
    "use_volume": "true",
    "ath_usd": "259.518",
    "ath_date": "2021-11-06 21:40:00",
    "not_trading_since": null,
    "last_update": "2024-03-07 19:03:29",
    "cycle_low_usd": 8.11582,
    "cycle_high_usd": 148.814,
    "cycle_low_date": "2022-12-29 20:40:00",
    "cycle_high_date": "2024-03-07 19:03:24",
    "image_id": "42838aa0-e9b8-4ec7-ff02-44bd94d32200",
    "cover_image_id": "6f267247-21b5-461f-6b57-e721f4292d00",
    "image_t": 1635175838,
    "total_total_supply": "571203745",
    "initial_data": {
        "date": "2020-04-09 08:45:00",
        "price_usd": "0.663252",
        "price_btc": "0.0000905958",
        "price_eth": "0.00385743"
    },
    "ath_data": {
        "ath_usd": 259.518,
        "ath_usd_date": "2021-11-06 21:40:00",
        "ath_btc": 0.00464506,
        "ath_btc_date": "2021-09-09 02:50:00",
        "ath_eth": 0.0612479,
        "ath_eth_date": "2021-09-09 02:50:00"
    },
    "atl_data": {
        "atl_usd": 0.503701,
        "atl_usd_date": "2020-05-11 19:15:00",
        "atl_btc": 4.51982e-05,
        "atl_btc_date": "2020-12-27 11:15:00",
        "atl_eth": 0.00155172,
        "atl_eth_date": "2021-01-07 00:05:00"
    },
    "social": {
        "Medium": "https://medium.com/solana-labs",
        "GitHub": "https://github.com/solana-labs/",
        "Discord": "https://discordapp.com/invite/pquxPsq",
        "Telegram": "https://t.me/solanaio",
        "Twitter": "https://twitter.com/solana",
        "Reddit": "https://www.reddit.com/r/solana"
    },
    "socials": [
        {
            "name": "Medium",
            "id": "479347",
            "coincodex_coin_symbol": "SOL",
            "coincodex_socials_id": "4",
            "value": "https://medium.com/solana-labs",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "GitHub",
            "id": "479350",
            "coincodex_coin_symbol": "SOL",
            "coincodex_socials_id": "9",
            "value": "https://github.com/solana-labs/",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Discord",
            "id": "479353",
            "coincodex_coin_symbol": "SOL",
            "coincodex_socials_id": "11",
            "value": "https://discordapp.com/invite/pquxPsq",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Telegram",
            "id": "479356",
            "coincodex_coin_symbol": "SOL",
            "coincodex_socials_id": "6",
            "value": "https://t.me/solanaio",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Twitter",
            "id": "479359",
            "coincodex_coin_symbol": "SOL",
            "coincodex_socials_id": "3",
            "value": "https://twitter.com/solana",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Reddit",
            "id": "479362",
            "coincodex_coin_symbol": "SOL",
            "coincodex_socials_id": "2",
            "value": "https://www.reddit.com/r/solana",
            "label": "",
            "order_by": "0"
        }
    ]
}