{
    "symbol": "TRX",
    "coin_name": "TRON",
    "shortname": "tron",
    "slug": "tron",
    "display_symbol": "TRX",
    "display": "true",
    "release_date": "2017-07-01",
    "ico_price": "0.001900000",
    "today_open": 0.137798897,
    "market_cap_rank": 12,
    "volume_rank": 53,
    "description": "<p>TRON is an open-source blockchain platform that went live in June of 2018. Prior to the mainnet launch, the platform&rsquo;s native asset TRX existed as an <a href=\"/cryptocurrencies/sector/ethereum-erc20/\" target=\"_blank\">ERC-20</a> token on the <a href=\"https://coincodex.com/crypto/ethereum/\" target=\"_blank\">Ethereum (ETH)</a> blockchain. The TRON blockchain is designed to host <a href=\"/article/2637/what-is-a-smart-contract/\" rel=\"nofollow noopener\" target=\"_blank\">smart contracts</a> and <a href=\"/article/2174/what-are-dapps/\" rel=\"nofollow noopener\" target=\"_blank\">decentralized applications</a> (dApps). Similar to the concept popularized by Ethereum, TRON can also be used to issue custom blockchain-based tokens, which must adhere to the project&rsquo;s own technical standards, such as TRC-10 and TRC-20.</p>\n\n<p><strong>Here&rsquo;s a quick overview of key facts about TRON and its core blockchain features:</strong></p>\n\n<ul>\n\t<li>TRON is a blockchain platform that uses a <a href=\"/article/16749/what-is-delegated-proof-of-stake-and-how-does-it-work/\" target=\"_blank\">delegated proof-of-stake</a> (DPoS) mechanism to reach a consensus about the state of its ledger</li>\n\t<li>The TRON ecosystem consists of a native NFT marketplace, interoperable <a href=\"https://coincodex.com/crypto/bittorrent/\" target=\"_blank\">BitTorrent Chain</a>, sidechains, and a decentralized stablecoin <a href=\"https://coincodex.com/crypto/decentralized-usd-stablecoin/\" target=\"_blank\">USDD (USDD)</a></li>\n\t<li>The TRON network shares a lot of similarities with Ethereum, both due to its token standards and smart contract functionality</li>\n\t<li>Chinese cryptocurrency billionaire <a href=\"/article/2810/who-is-justin-sun/\" target=\"_blank\">Justin Sun</a> founded the TRON foundation in 2017 to pursue a &ldquo;truly decentralized Internet&rdquo;</li>\n\t<li>The native digital currency of the TRON ecosystem, the TRX token, was initially sold in an ICO in 2017 <a href=\"/ico/tron/\" target=\"_blank\">at a price of roughly $0.0019 per coin</a></li>\n</ul>\n\n<h3>What is TRON and how does it work?</h3>\n\n<p>The TRON platform aims to provide the scalability required to support popular dApps by employing a delegated proof-of-stake (DPoS) architecture. This design allows the TRON network to perform fast transactions with minimal fees. This has allowed the platform to become one of the most active in the industry in terms of transaction volume &ndash; TRON-native <a href=\"https://coincodex.com/crypto/tether/\" target=\"_blank\">Tether (USDT)</a>, for instance, regularly tops the lists of most transacted cryptocurrencies.</p>\n\n<p>TRX holders use their tokens to vote for Super Representatives (SRs), which maintain the TRON blockchain. At any given time, the 27 SR candidates with the most votes are active and take part in the TRON blockchain&rsquo;s consensus process.&nbsp;</p>\n\n<p>Some of TRON&rsquo;s biggest competitors when it comes to popular blockchain platforms for smart contracts and dApps are Solana and Ethereum. Projects such as <a href=\"https://coincodex.com/crypto/bittorrent/\" target=\"_blank\">BitTorrent (BTT)</a> and <a href=\"https://www.coincodex.com/crypto/wink2/\" target=\"_blank\">WINkLInk (WIN)</a> have used the TRON platform to create their own tokens and raised funding through token sales.</p>\n\n<p>TRON employs a 3-layer blockchain design, with a dedicated storage, core, and application layer. TRX, which stands for TRONIX, is issued by TRON DAO, a decentralized autonomous organization (DAO) governing the TRON ecosystem. TRX is used as a primary medium of exchange and as the main asset covering transaction fees on the network.</p>\n\n<h3>Creation of TRON</h3>\n\n<p>The TRON project was founded by Chinese entrepreneur Justin Sun, and its development is headed by the TRON Foundation, which was established in 2017. The TRX token started trading on cryptocurrency exchanges in September of 2017, after the successful completion of the project&rsquo;s <a href=\"/article/2520/what-is-an-ico/\" target=\"_blank\">initial coin offering</a> (ICO) campaign in August 2017. In total, <a href=\"/convert/bitcoin/usd/15200/\" target=\"_blank\">15,200 BTC</a> (worth approx $70 million at the time) were raised in the month-long public sale of <a href=\"/convert/tron/usd/40000000000/\" target=\"_blank\">40 billion TRX</a>.</p>\n\n<p>Sun acquired San Francisco-based tech company BitTorrent Inc. in 2018. By leveraging the sizable existing user base of BitTorrent&rsquo;s products, the TRON team aims to boost the adoption of the TRON blockchain. BitTorrent launched BitTorrent Token (BTT), its own token on the TRON blockchain, in 2019.</p>\n\n<p>It is worth noting that Sun has drawn substantial amounts of <a href=\"https://www.theverge.com/c/22947663/justin-sun-tron-cryptocurrency-poloniex\" rel=\"noopener\" target=\"_blank\">criticism</a> over the years, both for his often brash and outspoken behavior and for allegedly copying features from competing blockchain platforms (such as decentralized stablecoin, token standards, etc.).</p>\n\n<p>According to TRON&rsquo;s 10-year roadmap, the final stage of the TRON development outlined in the <a href=\"https://tron.network/static/doc/white_paper_v_2_0.pdf\" rel=\"nofollow noopener\" target=\"_blank\">white paper</a> is slated to roll out in 2027. In the future, the TRON team intends to pursue safer and faster TROM Virtual Machine (TVM) operations for enhanced smart contract functionality, better cross-chain support, and deeper <a href=\"/cryptocurrencies/sector/defi/\" rel=\"nofollow noopener\" target=\"_blank\">decentralized finance</a> (DeFi) integrations, with an end goal of building an all-encompassing Web3 hub.</p>\n\n<h3>Overview of the TRON Ecosystem</h3>\n\n<p>In the years since its founding, the TRON project has grown to become one of the most feature-rich platforms in the industry thanks to its extensive suite of blockchain products and services. The platform features a dedicated <a href=\"/cryptocurrencies/sector/nft/\" target=\"_blank\">non-fungible token</a> (NFT) marketplace, fungible and non-fungible token standards, a specialized dApp system, an interoperable BTT Chain, a decentralized stablecoin, and more. We&rsquo;re going to discuss each of these features in more detail in the following sections.</p>\n\n<h4>Native TRON tokens</h4>\n\n<p>TRON allows for the creation of new tokens via three distinct token standards whose role in the ecosystem is similar to the role of <a href=\"/article/56/what-are-erc-20-tokens/\" target=\"_blank\">ERC-20</a>, <a href=\"/article/7554/what-is-the-ethereum-erc-721-standard/\" target=\"_blank\">ERC-721</a>, and others on the Ethereum platform. Here&rsquo;s a quick breakdown of TRON token standards:</p>\n\n<ul>\n\t<li><strong>TRC-10</strong> - TRC-10 tokens are based on the TRON blockchain rather than TVM. Each TRON network account can issue a new TRC-10 token by paying a one-time fee of 1,024 TRX. The TRC-10 token standard outlines rules for transactions and the issuance of new tokens.</li>\n</ul>\n\n<ul>\n\t<li><strong>TRC-20</strong> - TRC-20 is a set of smart contract standards which includes requirements for the issuance of TRC-20 digital assets. In addition, the TRC-20 token standard includes rules for supply, transfers, and asset docking. TRC-20 assets can be used to participate in various DeFi protocols.</li>\n</ul>\n\n<ul>\n\t<li><strong>TRC-721</strong> - TRON&rsquo;s third token standard is responsible for the issuance of non-fungible tokens (NFTs) on the TRON platform. The TRC-721 standard is fully compatible with Ethereum&#39;s non-fungible token standard called ERC-721.</li>\n</ul>\n\n<h4>BitTorrent Chain</h4>\n\n<p>BitTorrent Chain &ndash; also referred to as BTT Chain &ndash; is a scalable heterogeneous blockchain designed for cross-chain interoperability. BTT uses <a href=\"/article/7142/what-is-proof-of-stake/\" target=\"_blank\">Proof-of-Stake</a> (PoS) and multiple validator nodes to achieve a high degree of security, albeit at the cost of higher centralization. Thanks to a dedicated cross-chain bridge and inherent interoperability, BTT enables a seamless transfer of digital assets and dApps across supported blockchains.</p>\n\n<h4>NFT Marketplace</h4>\n\n<p>TRON&rsquo;s APENFT Marketplace allows users to create, discover, and trade NFTs. The platform is powered by BitTorrent File System (BTFS) &ndash; a type of decentralized storage connected to BTT Chain &ndash; which guarantees data safety and high reliability.</p>\n\n<h4>SUN Network</h4>\n\n<p>SUN Network, also known as DApChain, employs a sidechain design and is compatible with the TRON Protocol. Sidechains use DPoS consensus and connect to the TRON mainchain, which allows developers to more easily deploy and migrate dApps. In addition, thanks to their project-specific design, sidechains are cheaper to run and boast low-cost transactions.</p>\n\n<h4>USDD Stablecoin</h4>\n\n<p>USDD (originally named Digital USD and later renamed to USDD)&nbsp;is a decentralized stablecoin on TRON, BNB Chain, and Ethereum that is pegged to the value of the US dollar at a 1:1 ratio. USDD is issued by TRON DAO and collateralized with a basket of cryptocurrencies, including TRX and <a href=\"https://coincodex.com/crypto/usd-coin/\" target=\"_blank\">USD Coin (USDC)</a>.</p>\n\n<h4>TRON DAO</h4>\n\n<p>TRON DAO is the largest decentralized autonomous organization (DAO) in the industry. Users can participate in the DAO with TRX to take part in the decision-making process and directly influence the future development of the TRON platform.</p>\n\n<h3>TRON Price History</h3>\n\n<p>The native currency of the TRON network, the TRX token, was initially made available to investors in the initial coin offering (ICO) at <a href=\"/convert/bitcoin/usd/0.00000038/\" target=\"_blank\">0.00000038 BTC</a> per token in 2017. With BTC&rsquo;s historic price of roughly $4,600 at the time and 40 billion TRX sold, $70 million was raised in the public token sale.&nbsp;</p>\n\n<p>According to the TRON price chart and historical TRON price data, the price of TRX tokens increased by more than 50-fold in the span of fewer than 30 days between December 2017 and January 2018.&nbsp;</p>\n\n<p>Here is what the <a href=\"/crypto/tron/historical-data/\" target=\"_blank\">historical TRX price data</a> tells us about key milestones in the token&rsquo;s price history:</p>\n\n<ul>\n\t<li>$0.0019 - TRX coin&rsquo;s price at the time of the ICO sale in 2017 was $ 0.0019 per token</li>\n\t<li>$0.0100 - The price of TRON surpassed $0.0100 for the first time in mid-December 2017</li>\n\t<li>$0.0500 - TRON&rsquo;s price rallied beyond $0.0500 in the final days of December 2017</li>\n\t<li>$0.1000 - The price of TRX surged past $0.1000 for the first time in March 2018</li>\n\t<li>$0.2000 - TRON coin&rsquo;s price reached the $0.2000 price milestone in March 2018, just four months after the token initially started trading</li>\n</ul>\n\n<p>For a glimpse into potential future TRX price movements in addition to the TRON live price, you can follow our algorithmically generated <a href=\"/crypto/tron/price-prediction/\" target=\"_blank\">TRON price predictions</a> that take into account TRX&rsquo;s current price and a number of market indicators, including Fear &amp; Greed Index, market sentiment, overall volatility, and more. You can also check the up-to-date market rate of <a href=\"/convert/tron/usd/1/\" target=\"_blank\">1 TRX to USD</a> via our handy crypto-to-fiat and crypto-to-crypto conversion feature.</p>\n\n<h3>TRON Market Cap</h3>\n\n<p>The market cap of TRON has reflected high volatility in the crypto market ever since the token first became available to the broader community following the 2017&rsquo;s public token sale. TRON&rsquo;s market cap chart has been virtually directly aligned with the price movements of TRX due to the token&rsquo;s capped supply.</p>\n\n<p>Here&rsquo;s what the historical TRX price charts tell us about the crypto&rsquo;s most notable market cap milestones:</p>\n\n<ul>\n\t<li>$1 billion - The market cap of TRX surpassed $1 billion in December 2017</li>\n\t<li>$2 billion - Mere weeks after first claiming the $1 billion milestone, TRON&rsquo;s market cap rose to $2 billion in late December 2017</li>\n\t<li>$5 billion - In February 2018, TRX&rsquo;s market cap first surpassed the $5 billion mark</li>\n\t<li>$10 billion - TRON hit decacorn status in April 2021 and climbed to $13.6 billion later that same month</li>\n</ul>\n\n<h3>TRON Supply</h3>\n\n<p>Initially, <a href=\"/convert/tron/usd/100000000000/\" target=\"_blank\">100 billion TRX</a> were issued, out of which 40 billion were allocated for the ICO, 15.75 billion for the private token sale, and the remaining 54.25 billion were reserved for the team and the TRON Foundation. When the mainnet launched in June 2018, <a href=\"https://twitter.com/justinsuntron/status/1009832705461141505\" rel=\"noopener\" target=\"_blank\">1 billion TRX were burned</a> in celebration of TRON&rsquo;s so-called &ldquo;Independence Day&rdquo;. Additional burns in subsequent years, primarily due to the creation of USDD stablecoins, have brought the token&rsquo;s circulating supply down to roughly 92.5 billion TRX.&nbsp;</p>\n\n<p>TRON features no maximum supply &ndash; new TRX tokens are issued to so-called Super Representatives (see section <em>&ldquo;What is TRON and how does it work?&rdquo;</em> for more info) every six hours as a reward for securing the network and verifying transactions.</p>\n\n<h3>The most important TRON milestones</h3>\n\n<p>&nbsp;The TRON mainnet launched in 2018, following a successful ICO in 2017. Since its launch, TRON has become one of the largest crypto projects in the industry, both in terms of its market share and broad set of features. Here&rsquo;s a quick look at TRON&rsquo;s eventful past:</p>\n\n<ul>\n\t<li>July 2017 - Justin Sun founds the TRON Foundation with the aim of developing a &ldquo;truly decentralized Internet&rdquo;</li>\n\t<li>September 2017 - Investors buy $70 million worth of TRX in the initial token sale</li>\n\t<li>May 2018 - The release of the Odyssey 2.0 update sees the launch of the TRON mainnet&nbsp;</li>\n\t<li>June 2018 - TRX tokens switch from being Ethereum-based ERC-20 assets to being independent TRON network assets</li>\n\t<li>July 2018 - TRON acquires BitTorrent in a $126 million cash deal</li>\n\t<li>February 2019 - BitTorrent commences BTT token sale and outlines plans to launch the BitTorrent Chain</li>\n\t<li>April 2022 - APENFT launches as the first native NFT marketplace on the TRON blockchain</li>\n\t<li>May 2022 - TRON DAO <a href=\"/article/14298/justin-sun-announces-usdd-a-new-tron-based-decentralized-stablecoin/\" target=\"_blank\">launches</a> the USDD decentralized stablecoin</li>\n</ul>\n",
    "price_high_24_usd": 0.073316791,
    "price_low_24_usd": 0.064731666,
    "start": "2017-08-31 00:00:00",
    "end": "2017-09-02 23:59:00",
    "is_promoted": "false",
    "message": "",
    "website": "https://tron.network/index?lng=en",
    "whitepaper": "https://tron.network/resources?lng=en&name=1",
    "total_supply": "99281283754",
    "supply": 92345222419,
    "platform": "TRX",
    "how_to_buy_url": "/article/1693/how-to-buy-tron-trx-on-binance/",
    "last_price_usd": 0.12650990600190137,
    "price_change_1H_percent": "0.0608",
    "price_change_1D_percent": "0.8083",
    "price_change_7D_percent": "2.508",
    "price_change_30D_percent": "13.1898",
    "price_change_90D_percent": "-3.2215",
    "price_change_180D_percent": "23.1589",
    "price_change_365D_percent": "80.7031",
    "price_change_3Y_percent": "4.3042",
    "price_change_5Y_percent": "383.514",
    "price_change_ALL_percent": 6074.7692,
    "price_change_YTD_percent": "15.8372",
    "volume_24_usd": 639596992,
    "trading_since": "2017-09-13 01:20:00",
    "stages_start": "2017-08-31 00:00:00",
    "stages_end": "2017-09-02 23:59:00",
    "include_supply": "true",
    "use_volume": "true",
    "ath_usd": "0.302062",
    "ath_date": "2018-01-05 02:20:00",
    "not_trading_since": null,
    "last_update": "2024-03-07 19:03:29",
    "cycle_low_usd": 0.0073496,
    "cycle_high_usd": 0.179725,
    "cycle_low_date": "2020-03-13 02:25:00",
    "cycle_high_date": "2021-04-17 03:35:00",
    "image_id": "09f22af2-e7c6-414a-d4b1-8519b984a800",
    "cover_image_id": "39948195-7ff7-4e40-ea64-bf911ea0e000",
    "image_t": 1635236861,
    "total_total_supply": "92345217532",
    "initial_data": {
        "date": "2017-09-13 01:20:00",
        "price_usd": "0.00204882",
        "price_btc": "0.000000498301",
        "price_eth": "0.00000709234"
    },
    "ath_data": {
        "ath_usd": 0.302062,
        "ath_usd_date": "2018-01-05 02:20:00",
        "ath_btc": 1.98425e-05,
        "ath_btc_date": "2018-01-05 02:20:00",
        "ath_eth": 0.000307903,
        "ath_eth_date": "2018-01-05 02:20:00"
    },
    "atl_data": {
        "atl_usd": 0.00109126,
        "atl_usd_date": "2017-09-15 04:35:00",
        "atl_btc": 1.62224e-07,
        "atl_btc_date": "2017-12-06 07:00:00",
        "atl_eth": 3.90653e-06,
        "atl_eth_date": "2017-11-27 12:05:00"
    },
    "social": {
        "Explorer": "https://tronscan.org/#/",
        "Twitter": "https://twitter.com/Tronfoundation",
        "Reddit": "https://www.reddit.com/r/Tronix",
        "YouTube": "https://www.youtube.com/channel/UC5OPOGRq02iK-0T9sKse_kA",
        "GitHub": "https://github.com/tronprotocol",
        "Telegram": "https://t.me/tronnetworkEN03",
        "Facebook": "https://www.facebook.com/tronfoundation",
        "LinkedIn": "https://www.linkedin.com/company/tronfoundation",
        "Instagram": "https://www.instagram.com/tronfoundation",
        "Medium": "https://medium.com/tron-foundation",
        "Email": "trx@tron.network",
        "Explorer1": "https://etherscan.io/token/0x50327c6c5a14dcade707abad2e27eb517df87ab5",
        "Discord": "https://discordapp.com/invite/GsRgsTD",
        "Explorer2": "https://coincodex.enjinx.io/eth/token/0xf230b790e05390fc8295f4d3f60332c93bed42e2",
        "Explorer3": "https://eth.tokenview.io/en/address/0xf230b790e05390fc8295f4d3f60332c93bed42e2",
        "Explorer4": "https://trx.tokenview.io"
    },
    "socials": [
        {
            "name": "Explorer",
            "id": "473128",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "13",
            "value": "https://tronscan.org/#/",
            "label": "Tron Explorer",
            "order_by": "0"
        },
        {
            "name": "Twitter",
            "id": "473131",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "3",
            "value": "https://twitter.com/Tronfoundation",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Reddit",
            "id": "473134",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "2",
            "value": "https://www.reddit.com/r/Tronix",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "YouTube",
            "id": "473137",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "1",
            "value": "https://www.youtube.com/channel/UC5OPOGRq02iK-0T9sKse_kA",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "GitHub",
            "id": "473140",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "9",
            "value": "https://github.com/tronprotocol",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Telegram",
            "id": "473143",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "6",
            "value": "https://t.me/tronnetworkEN03",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Facebook",
            "id": "473146",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "7",
            "value": "https://www.facebook.com/tronfoundation",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "LinkedIn",
            "id": "473149",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "17",
            "value": "https://www.linkedin.com/company/tronfoundation",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Instagram",
            "id": "473152",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "16",
            "value": "https://www.instagram.com/tronfoundation",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Medium",
            "id": "473155",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "4",
            "value": "https://medium.com/tron-foundation",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Email",
            "id": "473158",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "21",
            "value": "trx@tron.network",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Explorer",
            "id": "473161",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "13",
            "value": "https://etherscan.io/token/0x50327c6c5a14dcade707abad2e27eb517df87ab5",
            "label": "Etherscan Explorer",
            "order_by": "0"
        },
        {
            "name": "Discord",
            "id": "473164",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "11",
            "value": "https://discordapp.com/invite/GsRgsTD",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Explorer",
            "id": "473167",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "13",
            "value": "https://coincodex.enjinx.io/eth/token/0xf230b790e05390fc8295f4d3f60332c93bed42e2",
            "label": "CoinCodex",
            "order_by": "-1"
        },
        {
            "name": "Explorer",
            "id": "473170",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "13",
            "value": "https://eth.tokenview.io/en/address/0xf230b790e05390fc8295f4d3f60332c93bed42e2",
            "label": "Tokenview",
            "order_by": "0"
        },
        {
            "name": "Explorer",
            "id": "473173",
            "coincodex_coin_symbol": "TRX",
            "coincodex_socials_id": "13",
            "value": "https://trx.tokenview.io",
            "label": "Tokenview",
            "order_by": "0"
        }
    ]
}