{
    "symbol": "XRP",
    "coin_name": "XRP",
    "shortname": "ripple",
    "slug": "ripple",
    "display_symbol": "XRP",
    "display": "true",
    "release_date": "2013-03-03",
    "ico_price": null,
    "today_open": 0.612489957,
    "market_cap_rank": 6,
    "volume_rank": 11,
    "description": "<p>XRP is a cryptocurrency that was launched in 2012 by Chris Larsen, Jed McCaleb, and Arthur Britto with the intent of creating a decentralized monetary system featuring a real-time gross settlement system, currency exchange, and remittance network. The maximum supply of XRP is 100 billion coins, which were all created at launch, meaning that it is not possible to produce additional XRP tokens. 80% of the total XRP supply was given to fintech firm OpenCoin, a company that was later renamed to Ripple Labs in 2013 and further rebranded to Ripple in 2015. Ripple still holds more than half of the total XRP supply, although a large portion of the company&rsquo;s XRP holdings is locked in escrow and can only be accessed periodically.</p>\n\n<p><strong>Here&rsquo;s a quick overview of key facts about XRP and its core blockchain features:</strong></p>\n\n<ul>\n\t<li>XRP is an open-source cryptocurrency that uses the unique XRP Ledger Consensus Protocol</li>\n\t<li>The company behind XRP, Ripple, is focused on building a decentralized payments network that facilitates low-cost and near-instantaneous cross-border transactions</li>\n\t<li>The XRP token and the XRP Ledger were launched in 2012, upon which 80 billion XRP out of the total 100 billion token supply were put in escrow</li>\n\t<li>Ripple&rsquo;s suite of financial products and services is used by a number of high-profile banking institutions, including American Express, Barclays, and BBVA</li>\n\t<li>XRP is a native digital currency of the Ripple network, which uses a shared distributed ledger to keep track of account balances and transactions</li>\n\t<li>RippleNet is a direct competitor to the global SWIFT settlement platform, with drastically lower transaction times</li>\n</ul>\n\n<h3>What is XRP and how does it work?</h3>\n\n<p>XRP is the native cryptocurrency of a blockchain called the XRP Ledger (XRPL). The XRP Ledger is quite unique among cryptocurrencies as it doesn&rsquo;t use either <a href=\"https://coincodex.com/article/2469/what-is-proof-of-work-pow/\" target=\"_blank\">Proof-of-Work</a> (PoW) nor <a href=\"https://coincodex.com/article/7142/what-is-proof-of-stake/\" target=\"_blank\">Proof-of-Stake</a> (PoS) to achieve consensus about the state of the ledger. Instead, it uses the XRP Ledger Consensus Protocol, which aims to provide a robust and decentralized network that can process transactions quickly and efficiently. Each operator of an XRP Ledger node can choose which nodes they deem trustworthy.</p>\n\n<p>To provide a real-time settlement layer with negligible fees and wait times, Ripple Labs uses a common shared ledger that stores blockchain data about user accounts and balances in a decentralized manner. This allows both institutions and individuals to validate financial information in seconds.&nbsp;</p>\n\n<p>Due to its speed and low cost, XRP can be used just like any other cryptocurrency for transferring value from wallet to wallet. However, Ripple is actively pushing for XRP to be used in large-scale implementations, particularly when it comes to cross-border transfers, where XRP is being positioned as an asset that could act as a bridge in transactions that involve different fiat currencies. To this end, Ripple has created a service called On-Demand Liquidity (ODL).&nbsp;</p>\n\n<p>Other potential use cases for XRP involve microtransactions related to online content (blogs, music, video) and the gaming industry. This allows XRP to serve as a cryptocurrency alternative to traditional financial solutions, something that some of the largest blockchain players&ndash;like <a href=\"https://coincodex.com/crypto/bitcoin/\" target=\"_blank\">Bitcoin</a> and <a href=\"https://coincodex.com/crypto/ethereum/\" target=\"_blank\">Ethereum</a>&ndash;cannot do natively due to high transaction costs on their respective networks.</p>\n\n<h3>Creation of XRP</h3>\n\n<p>Software developer Ryan Fugger founded Ripplepay in 2004, long before Bitcoin and the border digital asset boom. At the time, Fugger wanted to create a trustless system that would be able to provide secure financial transactions around the world.&nbsp;</p>\n\n<p>Bitcoin founder <a href=\"https://coincodex.com/article/48/who-is-satoshi-nakamoto-the-mystery-of-bitcoins-inventor/\" target=\"_blank\">Satoshi Nakamoto</a> gave a nod of approval to what Rupplepay was doing in the late 2000s, <a href=\"https://nakamotostudies.org/emails/satoshi-reply-to-mike-hearn/\" rel=\"nofollow noopener\" target=\"_blank\">stating</a>: &ldquo;Ripple is interesting in that it&rsquo;s the only other system that does something with trust besides concentrate it into a central server.&rdquo; Fugger sold Rippleypay to Jed McCaleb (co-founder of Stellar and founder of Mt.Gox), Arthur Britto (co-founder and President of PolySign), and David Schwartz (cryptography and computer security expert), who used the original formula and expanded on it with blockchain technology. The new owners renamed the company to OpenCoin.</p>\n\n<p>The origins of XRP as a cryptocurrency date back to 2012, when the founders of OpenCoin, a US-based fintech firm, launched XRP Ledger in the wake of Bitcoin&rsquo;s initial success. The company was later renamed to Ripple in 2015 and <a href=\"https://www.finextra.com/pressarticle/64842/ripple-receives-bitlicense\" rel=\"nofollow noopener\" target=\"_blank\">acquired a virtual currency license</a> from the New York State Department of Financial Services a year later.</p>\n\n<p>Ripple has developed several enterprise-oriented solutions for the banking industry over the past decade. Services like xRapid and xVia, which facilitate high-frequency intrabank transactions, are built atop xCurrent, the core product in Ripple&rsquo;s financial offering.&nbsp;</p>\n\n<p>Given the settlement time of just a couple of seconds compared to the SWIFT system&rsquo;s 2 to 3 days, a large number of the world&rsquo;s largest banks joined the RippleNet over the years. The network currently operates in more than 40 countries and has over 200 members, including Barclays, Intesa Sanpaolo, National Australia Bank, Scotiabank, BBVA, and American Express.</p>\n\n<p>However, it is worth noting that most members of the RippleNet don&rsquo;t use XRP tokens for transactions, but are instead using Ripple&rsquo;s decentralized settlement layer and software solutions without using the network&rsquo;s native digital currency.</p>\n\n<p>The US Securities and Exchange Commission (SEC) filed a <a href=\"/article/20369/sec-vs-xrp-lawsuit/\" target=\"_blank\">lawsuit against Ripple</a> and its CEO, Brad Garlinghouse, in December 2020, accusing the company of selling $1.3 billion worth of XRP tokens through an unregistered securities offering.&nbsp;</p>\n\n<p>In late 2021, Ripple began pushing for a clearer distinction between Ripple, the fintech company, and XRP, an independent cryptocurrency powering Ripple&rsquo;s network. The move came as a result of most people in the cryptocurrency community using the &ldquo;Ripple&rdquo; name to refer to the platform&rsquo;s underlying currency, which was a cause of much confusion over the years.&nbsp;</p>\n\n<h3>Ripple&rsquo;s XRP Price History</h3>\n\n<p>Launched in 2021, XRP is one of the oldest digital currencies in the cryptocurrency space. For the better part of the past decade, XRP tokens have been one of the most popular investment vehicles in the sector, <a href=\"https://coincodex.com/article/5981/best-ways-to-buy-xrp/\" target=\"_blank\">available to be bought</a> and traded on all popular crypto exchanges.</p>\n\n<p>Our <a href=\"https://coincodex.com/crypto/ripple/historical-data/\" target=\"_blank\">historical XRP price data</a> shows that the price of XRP was $0.0067 in early August of 2013. The XRP coin price remained virtually unchanged until late in 2013, when the crypto asset went on a nearly 10x run that saw XRP token price reach as high as $0.0614.</p>\n\n<p>The crypto winter between 2015 and 2017 saw XRP tumble back to the $0.0060 price range. &nbsp;Throughout 2017 and going into 2018, XRP&rsquo;s price increased by more than 600x and hit $3.92 in January 2018.</p>\n\n<p>The XRP cryptocurrency plunged below the $1 dollar range in the following crypto crash and it wasn&rsquo;t until April 2021 that the digital currency again retested the $1+ price levels. To see where the price of XRP is likely headed next and to observe XRP live price trends, feel free to use our algorithmically generated <a href=\"https://coincodex.com/crypto/ripple/price-prediction/\" target=\"_blank\">XRP price prediction</a> charts.</p>\n\n<h3>XRP Market Cap</h3>\n\n<p>Given the high token price volatility and a capped supply of 100 billion tokens, the XRP crypto market cap has seen considerable changes over the years. While XRP has a maximum supply of 100 billion coins, its circulating supply is artificially managed by Ripple which still holds over half of all tokens to ever exist, and periodically releases new tokens from their escrow.</p>\n\n<p>Here&rsquo;s what the XRP historical price data tell us about the crypto&rsquo;s most notable market cap milestones:</p>\n\n<ul>\n\t<li>$100 million - XRP first surpassed $100 million market cap in September 2013</li>\n\t<li>$500 million - The XRP market cap reached the $500 million milestone at the tail end of 2014</li>\n\t<li>$1 billion - &nbsp;XRP first reached unicorn status in February 2017</li>\n\t<li>$10 billion - The $10 billion market cap figure was attained in May 2017</li>\n\t<li>$50 billion - The market cap of XRP reached $50 billion in the last week of 2017</li>\n\t<li>$100 billion - The total value of all XRP tokens in circulation reached $100 billion in January 2018</li>\n</ul>\n\n<h3>XRP Supply</h3>\n\n<p>The supply of XRP is capped at 100 billion coins, which means that there is an artificially set final limit of total tokens, similar to Bitcoin. However, contrary to new Bitcoins, which enter circulation in a process known as cryptocurrency mining, the release of new XRP tokens is controlled by Ripple, the company behind XRP.&nbsp;</p>\n\n<p>Out of the maximum supply of 100 billion XRP tokens, over half is still managed by Ripple. This characteristic of XRP has led many to criticize the crypto for being centrally controlled and that its parent company has too much control over the price of XRP and its circulating supply.&nbsp;</p>\n\n<p>It is worth noting that Ripple CEO Brad Garlinghouse said in an <a href=\"https://www.youtube.com/watch?v=dPe499jDQ4E\" rel=\"nofollow noopener\" target=\"_blank\">interview</a> in 2021 that the company is open to new ideas about managing XRP, including the burning of tokens it holds in escrow.</p>\n\n<h3>The most important XRP milestones</h3>\n\n<p>XRP and its parent company have experienced a number of notable milestones in its decade-long history. Here is a list of important dates and events that have shaped XRP and its community over the years:</p>\n\n<ul>\n\t<li>June 2012 - OpenCoin launches XRP Ledger and puts 80 billion XRP in escrow</li>\n\t<li>April 2013 - The company receives $2.5 million in angel investment from Andreessen Horowitz and Pantera Capital</li>\n\t<li>September 2013 - OpenCoin renames to Ripple Labs (later rebranded to Ripple in October 2015)</li>\n\t<li>June 2016 - Ripple obtains a virtual currency license from the New York State Department of Financial Services</li>\n\t<li>January 2018 - XRP&rsquo;s market capitalization surpasses $130 billion at the beginning of 2018</li>\n\t<li>May 2018 - Banking giant Santander launched One Pay FX - the first cross-border mobile payment application powered by Ripple&rsquo;s xCurrent</li>\n\t<li>December 2019 - Ripple raises $200 million in a Series C funding round that saw participation from Tetragon, SBI Holdings, Route 66 Ventures</li>\n\t<li>December 2020 - The SEC files a lawsuit against Ripple, accusing the company of selling $1.3 billion worth of XRP through an unregistered securities offering</li>\n\t<li>November 2021 - Ripple pushes for a clearer distinction between the fintech company and the cryptocurrency XRP, which powers Ripple&rsquo;s network</li>\n</ul>\n",
    "price_high_24_usd": 0.629879631,
    "price_low_24_usd": 0.520695,
    "start": null,
    "end": null,
    "is_promoted": null,
    "message": "",
    "website": "https://ripple.com/",
    "whitepaper": "",
    "total_supply": "100000000000",
    "supply": 54664031281,
    "platform": "XRP",
    "how_to_buy_url": null,
    "last_price_usd": 0.629821365102115,
    "price_change_1H_percent": "0.6847",
    "price_change_1D_percent": "3.5711",
    "price_change_7D_percent": "4.1699",
    "price_change_30D_percent": "24.7368",
    "price_change_90D_percent": "-5.4854",
    "price_change_180D_percent": "24.5501",
    "price_change_365D_percent": "58.6652",
    "price_change_3Y_percent": "31.7591",
    "price_change_5Y_percent": "102.269",
    "price_change_ALL_percent": "10622.5",
    "price_change_YTD_percent": "1.0403",
    "volume_24_usd": 3936778240,
    "trading_since": "2013-08-04 18:55:00",
    "stages_start": null,
    "stages_end": null,
    "include_supply": "true",
    "use_volume": "true",
    "ath_usd": "3.91786",
    "ath_date": "2018-01-04 08:50:00",
    "not_trading_since": null,
    "last_update": "2024-03-07 19:02:29",
    "cycle_low_usd": 0.113268,
    "cycle_high_usd": 1.97793,
    "cycle_low_date": "2020-03-13 02:25:00",
    "cycle_high_date": "2021-04-14 05:25:00",
    "image_id": "6e034d86-8136-45f1-5629-197814db6700",
    "cover_image_id": "582eeb8d-68ff-4b38-9a70-5cbf0e655b00",
    "image_t": 1589271134,
    "total_total_supply": "99987852435",
    "initial_data": {
        "date": "2013-08-04 18:55:00",
        "price_usd": "0.00587384",
        "price_btc": "0.0000559413",
        "price_eth": "0"
    },
    "ath_data": {
        "ath_usd": 3.91786,
        "ath_usd_date": "2018-01-04 08:50:00",
        "ath_btc": 0.000264748,
        "ath_btc_date": "2018-01-04 08:50:00",
        "ath_eth": 0.013839,
        "ath_eth_date": "2015-08-10 07:35:00"
    },
    "atl_data": {
        "atl_usd": 0.00280235,
        "atl_usd_date": "2014-07-07 01:50:00",
        "atl_btc": 4.40229e-06,
        "atl_btc_date": "2017-03-01 23:35:00",
        "atl_eth": 0.000113035,
        "atl_eth_date": "2017-03-17 07:05:00"
    },
    "social": {
        "Explorer": "https://xrpcharts.ripple.com/#/graph/",
        "Message Board": "http://www.xrpchat.com/",
        "Twitter": "https://twitter.com/Ripple",
        "Reddit": "https://www.reddit.com/r/ripple",
        "GitHub": "https://github.com/ripple",
        "Chat": "https://t.me/Ripple",
        "Explorer1": "https://explorer.binance.org/asset/XRP-BF2",
        "Explorer2": "https://blockchair.com/ripple",
        "Facebook": "https://www.facebook.com/ripplepay"
    },
    "socials": [
        {
            "name": "Explorer",
            "id": "500524",
            "coincodex_coin_symbol": "XRP",
            "coincodex_socials_id": "13",
            "value": "https://xrpcharts.ripple.com/#/graph/",
            "label": "XRPCharts",
            "order_by": "0"
        },
        {
            "name": "Message Board",
            "id": "500527",
            "coincodex_coin_symbol": "XRP",
            "coincodex_socials_id": "14",
            "value": "http://www.xrpchat.com/",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Twitter",
            "id": "500530",
            "coincodex_coin_symbol": "XRP",
            "coincodex_socials_id": "3",
            "value": "https://twitter.com/Ripple",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Reddit",
            "id": "500533",
            "coincodex_coin_symbol": "XRP",
            "coincodex_socials_id": "2",
            "value": "https://www.reddit.com/r/ripple",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "GitHub",
            "id": "500536",
            "coincodex_coin_symbol": "XRP",
            "coincodex_socials_id": "9",
            "value": "https://github.com/ripple",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Chat",
            "id": "500539",
            "coincodex_coin_symbol": "XRP",
            "coincodex_socials_id": "15",
            "value": "https://t.me/Ripple",
            "label": "",
            "order_by": "0"
        },
        {
            "name": "Explorer",
            "id": "500542",
            "coincodex_coin_symbol": "XRP",
            "coincodex_socials_id": "13",
            "value": "https://explorer.binance.org/asset/XRP-BF2",
            "label": "Binance Explorer",
            "order_by": "0"
        },
        {
            "name": "Explorer",
            "id": "500545",
            "coincodex_coin_symbol": "XRP",
            "coincodex_socials_id": "13",
            "value": "https://blockchair.com/ripple",
            "label": "Blockchair",
            "order_by": "0"
        },
        {
            "name": "Facebook",
            "id": "500548",
            "coincodex_coin_symbol": "XRP",
            "coincodex_socials_id": "7",
            "value": "https://www.facebook.com/ripplepay",
            "label": "",
            "order_by": "0"
        }
    ]
}